from .station_list import *

tokyo = [
    # ================= 乗車券 =================
    ["令和3年10月30日", "下町日和きっぷ 京成千葉<->都内フリー区間"],
    ["令和3年11月13日", "休日おでかけパス"],
    ["令和3年11月13日", "江の島電鉄1日乗車券のりおりくん"],
    ["令和3年12月18日", "東京フリーきっぷ"],
    ["令和4年04月01日", "千葉都市モノレール お昼のおでかけフリーきっぷ"],
    ["令和4年10月16日", "休日お出かけパス 鉄道開業150周年"],
    ["令和6年02月19日", "東京メトロ24時間券"]
    # ================= 特急券 =================
    # ================= 入場券 =================
    # ================= 食事 =================
]

tokyo_images = [
    "令和3年10月30日~ 東京",
    [
        # =================================================
        ["../trainCar/NoImage.jpg", "開発中"],
    ]
]

tokyo_stations = [
    [Chiba, Tokyo, Chiba]
]
