from .station_list import *

tokai = [
    # ================= 乗車券 =================
    ["令和7年11月2日", "篠ノ井線経由乗車券 広丘->塩尻(連続1)"],
    ["令和7年11月2日-令和7年11月3日", "中央西線・東海道本線・身延線・中央東線経由乗車券 塩尻->塩尻(連続2)"],
    ["令和7年11月3日", "篠ノ井線経由乗車券 塩尻->広丘"],
    ["令和7年11月2日", "愛知環状鉄道経由乗車券 岡崎->中岡崎(往復(ゆき))"],
    ["令和7年11月2日", "愛知環状鉄道経由乗車券 中岡崎->岡崎(往復(かえり))"],
    ["令和7年11月2日", "飯田線経由乗車券 豊橋->豊川(往復(ゆき))"],
    ["令和7年11月2日", "飯田線経由乗車券 豊川->豊橋(往復(かえり))"],
    ["令和7年11月2日", "豊橋鉄道 市内電車 1日フリー乗車券"],
    # ================= 特急券 =================
    ["令和7年11月2日", "特急しなの4号指定席特急券 塩尻->名古屋"],
    ["令和7年11月2日", "東海道新幹線こだま740号自由席特急券 豊橋->浜松"],
    ["令和7年11月3日", "東海道新幹線こだま708号自由席特急券 掛川->静岡"],
    ["令和7年11月3日", "特急ふじかわ5号指定席特急券 富士->甲府"],
    ["令和7年11月3日", "特急あずさ25号指定席特急券 甲府->塩尻"],
    # ================= 入場券 =================
    ["令和7年11月2日", "岡崎城 入場券"],
    ["令和7年11月3日", "掛川城天守閣・御殿 入館券"],
    # ================= 食事 =================
    ["令和7年11月2日", "豊橋駅 ふわふわちくわそば"],
    ["令和7年11月2日", "豊橋駅 壺屋 稲荷寿司 1/2"],
    ["令和7年11月2日", "豊橋駅 壺屋 稲荷寿司 2/2"],
]

tokai_images = [
    "令和7年11月2日~令和7年11月3日 東海旅行(中央本線・東海道本線・身延線)",
    [
        # =================================================
        ["../trainCar/NoImage.jpg", "開発中"],
    ]
]

tokai_stations = [
    # ============================ R7/11/02 ============================
    [Minami_Matsumoto, Shiojiri, Kanayama, Nagoya, Kanayama, Okazaki, Naka_Okazaki, Okazaki, Toyohashi, Toyokawa, Toyohashi, Hamamatsu],
    # ============================ R7/11/03 ============================
    [Hamamatsu, Kakegawa, Shizuoka, Shimizu, Fuji, Kofu, Shiojiri, Minami_Matsumoto],
]
