ise = [["令和3年8月25日", "東海道新幹線のぞみ211号指定席特急券 東京(都区内)->名古屋(市内)"],
       ["令和3年8月25日", "関西本線・伊勢鉄道・紀勢本線・参宮線経由乗車券 名古屋->伊勢市"],
       ["令和3年8月25日", "近畿日本鉄道 名伊乙特急自由席特急券 宇治山田->近鉄名古屋"],
       ["令和3年8月25日", "東海道新幹線のぞみ246号指定席特急券 名古屋(市内)->東京(都区内)"]]

bousou = [["令和4年2月11日-令和4年2月12日", "週末パス"],
          ["令和4年2月11日", "特急わかしお7号自由席特急券 蘇我->安房鴨川"],
          ["令和4年2月11日", "特急新宿さざなみ2号自由席特急券 蘇我->安房鴨川"]]

nagano = [["令和4年2月12日", "北陸新幹線かがやき505号指定席特急券 東京->長野"],
          ["令和4年2月12日", "長野電鉄A特急スノーモンキー自由席特急券 権堂->長野"],
          ["令和4年2月12日", "特急千葉あずさ50号指定席特急券 松本->千葉"],
          ["令和4年2月12日", "善光寺共通券(三堂・史料館参拝券)"]]
