ise = [["R30825", "東海道新幹線のぞみ211号指定席特急券 東京(都区内)->名古屋(市内)"],
       ["R30825", "関西本線・伊勢鉄道・紀勢本線・参宮線経由乗車券 名古屋->伊勢市"],
       ["R30825", "近畿日本鉄道 名伊乙特急自由席特急券 宇治山田->近鉄名古屋"],
       ["R30825", "東海道新幹線のぞみ246号指定席特急券 名古屋(市内)->東京(都区内)"]]

bousou = [["R40211-R30212", "週末パス"],
          ["R40211", "特急わかしお7号自由席特急券 蘇我->安房鴨川"],
          ["R40211" "特急新宿さざなみ2号自由席特急券 蘇我->安房鴨川"]]

nagano = [["R40212", "北陸新幹線かがやき505号指定席特急券 東京->長野"],
          ["R40212", "長野電鉄A特急スノーモンキー自由席特急券 権堂->長野"],
          ["R40212", "特急千葉あずさ50号指定席特急券 松本->千葉"],
          ["R40212", "善光寺共通券(三堂・史料館参拝券)"]]
