kusatsu = [
    # ================= 切符 =================
    ["令和6年09月08日", "総武本線・東北本線・高崎線・上越線・吾妻線経由乗車券 千葉->長野原草津口"],
    ["令和6年09月08日", "吾妻線・上越線経由乗車券 長野原草津口->高崎"],
    ["令和6年09月09日", "上信電鉄経由乗車券 高崎->上州富岡"],
    ["令和6年09月09日", "上信電鉄経由乗車券 上州富岡->高崎"],
    ["令和6年09月09日", "高崎線・川越線経由乗車券 高崎->川越"],
    ["令和6年09月08日", "特急草津・四万31号指定席特急券 上野->長野原草津口"],
    # ================= 入場券 =================
    ["令和6年09月08日", "草津温泉 熱乃湯 湯もみと踊り 観覧券"],
    ["令和6年09月08日", "富岡製糸場　見学券"],
    # ================= 食事 =================
    ["令和6年09月08日", "草津温泉 手打蕎麦 あおやま 舞茸天丼セット"],
    ["令和6年09月08日", "高崎駅 だるま弁当 1/2"],
    ["令和6年09月08日", "高崎駅 だるま弁当 2/2"]
]
