conference = [
    # ================= 切符 =================
    ["令和5年12月13日", "総武本線・上越新幹線経由乗車券 東千葉->新潟(往復(ゆき))"],
    ["令和5年12月16日", "上越新幹線・総武本線経由乗車券 新潟->東千葉(往復(かえり))"],
    ["令和5年12月13日", "上越新幹線とき317号自由席特急券 東京->新潟"],
    ["令和5年12月16日", "上越新幹線とき344号自由席特急券 新潟->東京"],
    # ================= 食事 =================
    ["令和5年12月13日", "とんかつ政ちゃん 新潟駅前店 タレかつ丼"],
    ["令和5年12月14日", "万代シティ バスセンターのカレー 1/2"],
    ["令和5年12月14日", "万代シティ バスセンターのカレー 2/2"],
    ["令和5年12月16日", "新潟駅 たれカツ重 1/2"],
    ["令和5年12月16日", "新潟駅 たれカツ重 2/2"],
    ["令和5年12月16日", "亀田製菓 サラダホープ(新潟限定)"],
    ["令和5年12月16日", "浪花屋製菓 元祖 柿の種 1/3"],
    ["令和5年12月16日", "浪花屋製菓 元祖 柿の種 2/3"],
    ["令和5年12月16日", "浪花屋製菓 元祖 柿の種 3/3"],
    ["令和5年12月16日", "新潟 南蛮えび煎餅 1/2"],
    ["令和5年12月16日", "新潟 南蛮えび煎餅 2/2"],
    ["令和5年12月16日", "八海山 純米吟醸"],
]
