conference = [
    # ============================ SI2022 ============================
    ["令和4年12月14日-令和4年12月16日", "第23回計測自動制御学会システムインテグレーション部門講演会(SI2022)"],
    # ================= 切符 =================
    # ================= 食事 =================
    # ============================ ROBOMECH2023 ============================
    ["令和5年6月28日-令和5年7月1日", "ロボティクス・メカトロニクス講演会2023(ROBOMECH2023)"],
    # ================= 切符 =================
    # ================= 食事 =================
    ["令和5年6月28日", "四代目 一八 きしめん 金山店 きしめん"],
    ["令和5年6月28日", "とんかつマ・メゾン アスナル金山店 味噌カツ"],
    ["令和5年6月29日", "川次(うなぎ) ひつまぶし"],
    ["令和5年6月30日", "ういろう"],
    ["令和5年6月30日", "カントリーマアム小倉トースト"],
    # ============================ SI2023 ============================
    ["令和5年12月14日-令和5年12月16日", "第24回計測自動制御学会システムインテグレーション部門講演会(SI2023)"],
    # ================= 切符 =================
    ["令和5年12月13日", "総武本線・上越新幹線経由乗車券 東千葉->新潟(往復(ゆき))"],
    ["令和5年12月16日", "上越新幹線・総武本線経由乗車券 新潟->東千葉(往復(かえり))"],
    ["令和5年12月13日", "上越新幹線とき317号自由席特急券 東京->新潟"],
    ["令和5年12月16日", "上越新幹線とき344号自由席特急券 新潟->東京"],
    # ================= 食事 =================
    ["令和5年12月13日", "とんかつ政ちゃん 新潟駅前店 タレかつ丼"],
    ["令和5年12月14日", "万代シティ バスセンターのカレー 1/2"],
    ["令和5年12月14日", "万代シティ バスセンターのカレー 2/2"],
    ["令和5年12月16日", "新潟駅 たれカツ重 1/2"],
    ["令和5年12月16日", "新潟駅 たれカツ重 2/2"],
    ["令和5年12月16日", "亀田製菓 サラダホープ(新潟限定)"],
    ["令和5年12月16日", "浪花屋製菓 元祖 柿の種 1/3"],
    ["令和5年12月16日", "浪花屋製菓 元祖 柿の種 2/3"],
    ["令和5年12月16日", "浪花屋製菓 元祖 柿の種 3/3"],
    ["令和5年12月16日", "新潟 南蛮えび煎餅 1/2"],
    ["令和5年12月16日", "新潟 南蛮えび煎餅 2/2"],
    ["令和5年12月16日", "八海山 純米吟醸"],
    # ============================ ICRA2024 ============================
    ["令和6年5月13日-令和6年5月17日", "IEEE International Conference on Robotics and Automation(ICRA2024)"],
    # ================= 切符 =================
    # ================= 食事 =================
    # ============================ CBS2024 ============================
    ["令和6年11月20日-令和6年11月22日", "IEEE International Conference on Cyborg and Bionic Systems(CBS2024)"],
    # ================= 切符 =================
    ["令和6年11月19日", "総武本線・東海道新幹線・東海道本線経由乗車券 東千葉->岐阜(往復(ゆき))"],
    ["令和6年11月19日-令和6年11月22日", "東海道本線・東海道新幹線・総武本線経由乗車券 岐阜->東千葉(往復(かえり))"],
    ["令和6年11月19日", "東海道新幹線のぞみ327号自由席特急券 東京->名古屋"],
    ["令和6年11月22日", "東海道新幹線ひかり650号自由席特急券 名古屋->東京"],
    # ================= 入場券 =================
    ["令和6年11月19日", "ぎふ金華山ロープウェー 往復乗車券"],
    ["令和6年11月19日", "岐阜城 入場券"],
    # ================= 食事 =================
    ["令和6年11月19日", "つつむ おにぎり2個と豚汁セット"],
    ["令和6年11月19日", "山本屋総本家 味噌煮込みうどん"],
    ["令和6年11月20日", "名古屋駅 ひつまぶし弁当 1/2"],
    ["令和6年11月20日", "名古屋駅 ひつまぶし弁当 2/2"],
    ["令和6年11月22日", "ういろう"],
    ["令和6年11月22日", "小倉あんパフェサンド"],
    # ============================ SI2024 ============================
    ["令和6年12月18日-令和6年12月20日", "第25回計測自動制御学会システムインテグレーション部門講演会(SI2024)"],
    # ================= 切符 =================
    ["令和6年12月17日", "総武本線・東北新幹線経由乗車券 東千葉->いわて沼宮内(往復(ゆき))"],
    ["令和6年12月20日", "東北新幹線・総武本線経由乗車券 いわて沼宮内->東千葉(往復(かえり))"],
    ["令和6年12月17日", "東北新幹線はやぶさ11号・やまびこ53号指定席特急券 東京->一ノ関"],
    ["令和6年12月17日", "東北新幹線はやぶさ11号指定席特急券 東京->仙台"],
    ["令和6年12月17日", "東北新幹線やまびこ53号指定席特急券 仙台->一ノ関"],
    ["令和6年12月20日", "東北新幹線はやぶさ42号指定席特急券 盛岡->東京"],
    # ================= 入場券 =================
    ["令和6年12月17日", "平泉世界遺産ガイダンスセンター 入館券"],
    ["令和6年12月17日", "中尊寺金色堂 拝観券"],
    ["令和6年12月17日", "毛越寺 拝観券"],
    # ================= 食事 =================
    ["令和6年12月17日", "東屋本店 かつ丼"],
    ["令和6年12月19日", "盛岡冷麺"],
    ["令和6年12月20日", "牛肉どまん中 1/2"],
    ["令和6年12月20日", "牛肉どまん中 2/2"],
]
