from .station_list import *

ise = [
    # ================= 乗車券 =================
    # ================= 特急券 =================
    ["令和3年8月25日", "東海道新幹線のぞみ211号指定席特急券 東京(都区内)->名古屋(市内)"],
    ["令和3年8月25日", "関西本線・伊勢鉄道・紀勢本線・参宮線経由乗車券 名古屋->伊勢市"],
    ["令和3年8月25日", "近畿日本鉄道 名伊乙特急自由席特急券 宇治山田->近鉄名古屋"],
    ["令和3年8月25日", "東海道新幹線のぞみ246号指定席特急券 名古屋(市内)->東京(都区内)"],
    # ================= 入場券 =================
    # ================= 食事 =================
    ["令和3年8月25日", "名古屋駅 天むす"],
    ["令和3年8月25日", "伊勢市駅 伊勢神宮 赤福 1/2"],
    ["令和3年8月25日", "伊勢市駅 伊勢神宮 赤福 2/2"],
    ["令和3年8月25日", "名古屋駅 びっくり味噌かつ 1/2"],
    ["令和3年8月25日", "名古屋駅 びっくり味噌かつ 2/2"]
]

ise_images = [
    "令和3年8月25日 伊勢神宮参拝",
    [
        # =================================================
        ["../trainCar/NoImage.jpg", "開発中"],
    ]
]

ise_stations = [
    [Chiba, Tokyo, Nagoya, Iseshi, Ujiyamada, Iseshi, Nagoya, Tokyo, Chiba]
]
