from .station_list import *

bousou_nagano = [
    # ================= 乗車券 =================
    ["令和4年2月11日-令和4年2月12日", "週末パス"],
    # ================= 特急券 =================
    ["令和4年2月11日", "特急わかしお7号自由席特急券 蘇我->安房鴨川"],
    ["令和4年2月11日", "特急新宿さざなみ2号自由席特急券 館山->千葉"],
    ["令和4年2月12日", "北陸新幹線かがやき505号指定席特急券 東京->長野"],
    ["令和4年2月12日", "長野電鉄A特急スノーモンキー自由席特急券 権堂->長野"],
    ["令和4年2月12日", "特急千葉あずさ50号指定席特急券 松本->千葉"],
    # ================= 入場券 =================
    ["令和4年2月12日", "善光寺共通券(三堂・史料館参拝券)"]
    # ================= 食事 =================
]

bousou_nagano_images = [
    "令和4年2月11日~令和4年2月12日 週末パス(房総・長野)",
    [
        # =================================================
        ["../trainCar/NoImage.jpg", "開発中"],
    ]
]

bousou_nagano_stations = [
    [Chiba, Tokyo, Chiba]
]
