tohoku_ou = [
    # ================= 切符 =================
    ["令和4年3月1日-令和4年3月3日", "総武本線・東北本線経由乗車券 東千葉->陸前山王"],
    ["令和4年3月3日-令和4年3月8日", "東北本線・IGRいわて銀河鉄道線・青い森鉄道線・奥羽本線・東北新幹線・東北本線・常磐線・東北本線・総武本線経由乗車券 陸前山王->東千葉"],
    ["令和4年3月1日", "日光線経由乗車券 宇都宮->日光(往復(ゆき))"],
    ["令和4年3月1日", "日光線経由乗車券 日光->宇都宮(往復(かえり))"],
    ["令和4年3月5日", "特急つがる2号自由席特急券 弘前->秋田"],
    ["令和4年3月5日", "秋田新幹線こまち28号立席特急券 秋田->大曲"],
    ["令和4年3月5日", "山形新幹線つばさ156号自由席特急券 新庄->山形"],
    ["令和4年3月6日", "山形新幹線つばさ132号自由席特急券 山形->赤湯"],
    ["令和4年3月6日", "山形新幹線つばさ142号自由席特急券 米沢->福島"],
    ["令和4年3月6日", "東北新幹線やまびこ61号自由席特急券 福島->仙台"],
    ["令和4年3月7日", "特急ひたち14号指定席特急券 仙台->常陸多賀"],
    ["令和4年3月8日", "特急ひたち8号指定席特急券 水戸->東京"],
    ["令和4年3月1日", "東武バス中禅寺温泉フリーパス"],
    ["令和4年3月1日", "日光東照宮拝観券"],
    ["令和4年3月1日", "華厳滝エレベーター大人昇降券"],
    ["令和4年3月3日", "るーぷる仙台・地下鉄共通1日乗車券"],
    ["令和4年3月3日", "福浦橋通行券"],
    # ================= 食事 =================
    ["令和4年3月2日", "仙台駅 牛たん弁当 1/2"],
    ["令和4年3月2日", "仙台駅 牛たん弁当 2/2"],
    ["令和4年3月5日", "秋田駅 しらかみネギそば"],
    ["令和4年3月5日", "山形駅 牛肉どまん中 1/2"],
    ["令和4年3月5日", "山形駅 牛肉どまん中 2/2"],
    ["令和4年3月6日", "米沢駅 天ぷらうどん"]
]

tohoku_ou_images = [
    "R4/3/1~R4/3/8 東北一周旅行(東北・奥羽・常磐)",
    [
        # =================================================
        ["12_千葉県/駅舎_千葉駅.jpg", "千葉駅 駅舎"],
        # --------------------------------------
        ["12_千葉県/駅名標_千葉駅_総武本線.jpg", "千葉駅 駅名標"],
        ["../trainCar/12_千葉県/千葉駅_E217系.jpg", "総武快速線 千葉駅-->東京駅"],
        ["13_東京都/駅名標_東京駅_在来線_地下ホーム.jpg", "東京駅 駅名標(在来線)"],
        # --------------------------------------
        ["13_東京都/駅名標_東京駅_東北新幹線.jpg", "東京駅 駅名標(新幹線)"],
        ["../trainCar/13_東京都/東京駅_E5系.jpg", "東北新幹線 東京駅-->郡山駅"],
        ["07_福島県/駅名標_郡山駅_新幹線.jpg", "郡山駅 駅名標(新幹線)"],
        # --------------------------------------
        ["07_福島県/駅名標_郡山駅_在来線.jpg", "郡山駅 駅名標(在来線)"],
        ["../trainCar/07_福島県/郡山駅_E721系.jpg", "磐越西線 郡山駅-->会津若松駅"],
        ["07_福島県/駅名標_会津若松駅.jpg", "会津若松駅 駅名標"],
        # =================================================
        ["07_福島県/駅舎_会津若松駅.jpg", "会津若松駅 駅舎"],
        ["07_福島県/会津若松城.jpg", "会津若松城"],
        ["07_福島県/茶室麟閣.jpg", "茶室麟閣"],
        ["07_福島県/駅舎_七日町駅.jpg", "七日町駅 駅舎"],
        # --------------------------------------
        ["07_福島県/駅名標_七日町駅.jpg", "七日町駅 駅名標"],
        ["../trainCar/07_福島県/七日町駅_AT-550形.jpg", "会津鉄道 七日町駅-->会津若松駅"],
        ["07_福島県/駅名標_会津若松駅.jpg", "会津若松駅 駅名標"],
        ["../trainCar/07_福島県/会津若松駅_E721系.jpg", "磐越西線 会津若松駅-->郡山駅"],
        ["07_福島県/磐梯山.jpg", "磐梯山"],
        ["07_福島県/駅名標_郡山駅_在来線.jpg", "郡山駅 駅名標(在来線)"],
        # =================================================
        ["07_福島県/駅舎_郡山駅.jpg", "郡山駅 駅舎"],
        # --------------------------------------
        ["07_福島県/駅名標_郡山駅_新幹線.jpg", "郡山駅 駅名標(新幹線)"],
        ["../trainCar/07_福島県/郡山駅_E5系.jpg", "東北新幹線 郡山駅-->福島駅"],
        ["07_福島県/駅名標_福島駅_新幹線.jpg", "福島駅 駅名標(新幹線)"],
        # =================================================
        ["07_福島県/駅舎_福島駅.jpg", "福島駅 駅舎"],
        # --------------------------------------
        ["07_福島県/駅名標_福島駅_新幹線.jpg", "福島駅 駅名標(新幹線)"],
        ["../trainCar/04_宮城県/仙台駅_E5系.jpg", "東北新幹線 福島駅-->仙台駅"],
        ["04_宮城県/駅名標_仙台駅_新幹線.jpg", "仙台駅 駅名標(新幹線)"],
        # =================================================
        ["04_宮城県/駅舎_仙台駅_昼.jpg", "仙台駅 駅舎"],
        ["04_宮城県/AER展望テラス.jpg", "AER展望テラス"],
        # --------------------------------------
        ["04_宮城県/駅名標_仙台駅_新幹線.jpg", "仙台駅 駅名標(新幹線)"],
        ["../trainCar/04_宮城県/仙台駅_E5系.jpg", "東北新幹線 仙台駅-->新青森駅"],
        ["02_青森県/駅名標_新青森駅_新幹線.jpg", "新青森駅 駅名標(新幹線)"],
        # --------------------------------------
        ["02_青森県/駅名標_新青森駅_在来線.jpg", "新青森駅 駅名標(在来線)"],
        ["../trainCar/02_青森県/青森駅_E701系.jpg", "奥羽本線 新青森駅-->青森駅"],
        ["02_青森県/駅名標_青森駅.jpg", "青森駅 駅名標"],
        # =================================================
        ["02_青森県/駅舎_青森駅.jpg", "青森駅 駅舎"],
        ["02_青森県/青森駅_青森ベイブリッジ.jpg", "青森駅 青森ベイブリッジ"],
        # --------------------------------------
        ["02_青森県/駅名標_青森駅.jpg", "青森駅 駅名標"],
        ["../trainCar/02_青森県/青森駅_E701系.jpg", "奥羽本線 青森駅-->新青森駅"],
        ["02_青森県/駅名標_新青森駅_在来線.jpg", "新青森駅 駅名標(在来線)"],
        # =================================================
        ["02_青森県/駅舎_新青森駅.jpg", "新青森駅 駅舎"],
        ["02_青森県/りんご自販機.jpg", "新青森駅 りんご自販機"],
        # --------------------------------------
        ["02_青森県/駅名標_新青森駅_新幹線.jpg", "新青森駅 駅名標(新幹線)"],
        ["../trainCar/02_青森県/新青森駅_E5系.jpg", "東北新幹線 新青森駅-->盛岡駅"],
        ["03_岩手県/駅名標_盛岡駅_東北新幹線.jpg", "盛岡駅 駅名標(新幹線)"],
        # =================================================
        ["03_岩手県/駅舎_盛岡駅.jpg", "盛岡駅 駅舎"],
        # --------------------------------------
        ["03_岩手県/駅名標_盛岡駅_秋田新幹線.jpg", "盛岡駅 駅名標(新幹線)"],
        ["../trainCar/03_岩手県/盛岡駅_E6系.jpg", "東北新幹線 盛岡駅-->角館駅"],
        ["05_秋田県/駅名標_角館駅.jpg", "角館駅 駅名標"],
        # =================================================
        ["05_秋田県/駅舎_角館駅.jpg", "角館駅 駅舎"],
        ["05_秋田県/角館武家屋敷通り.jpg", "角館武家屋敷通り"],
        ["05_秋田県/河原田家.jpg", "河原田家"],
        # --------------------------------------
        ["05_秋田県/駅名標_角館駅.jpg", "角館駅 駅名標"],
        ["../trainCar/05_秋田県/角館駅_E6系.jpg", "秋田新幹線 角館駅-->秋田駅"],
        ["05_秋田県/駅名標_秋田駅_新幹線.jpg", "秋田駅 駅名標(新幹線)"],
        # =================================================
        ["05_秋田県/駅舎_秋田駅.jpg", "秋田駅 駅舎"],
        # --------------------------------------
        ["05_秋田県/駅名標_秋田駅_在来線.jpg", "秋田駅 駅名標(在来線)"],
        ["../trainCar/05_秋田県/秋田駅_E653系.jpg", "羽越本線 秋田駅-->酒田駅"],
        ["06_山形県/駅名標_酒田駅.jpg", "酒田駅 駅名標"],
        # =================================================
        ["06_山形県/駅舎_酒田駅.jpg", "酒田駅 駅舎"],
        ["06_山形県/山居倉庫.jpg", "山居倉庫"],
        ["06_山形県/本間家旧本邸.jpg", "本間家旧本邸"],
        # --------------------------------------
        ["06_山形県/駅名標_酒田駅.jpg", "酒田駅 駅名標"],
        ["../trainCar/06_山形県/酒田駅_E653系.jpg", "羽越本線 酒田駅-->新発田駅"],
        ["15_新潟県/笹川流れ.jpg", "笹川流れ"],
        ["15_新潟県/駅名標_新発田駅.jpg", "新発田駅 駅名標"],
        # =================================================
        ["15_新潟県/駅舎_新発田駅.jpg", "新発田駅 駅舎"],
        ["15_新潟県/新発田城.jpg", "新発田城"],
        # --------------------------------------
        ["15_新潟県/駅名標_新発田駅.jpg", "新発田駅 駅名標"],
        ["../trainCar/15_新潟県/新発田駅_E653系.jpg", "白新線 新発田駅-->新潟駅"],
        ["15_新潟県/駅名標_新潟駅_在来線.jpg", "新潟駅 駅名標(在来線)"],
        # =================================================
        ["15_新潟県/駅舎_新潟駅.jpg", "新潟駅 駅舎"],
        # --------------------------------------
        ["15_新潟県/駅名標_新潟駅_新幹線.jpg", "新潟駅 駅名標(新幹線)"],
        ["../trainCar/15_新潟県/新潟駅_E7系.jpg", "上越新幹線 新潟駅-->東京駅"],
        ["13_東京都/駅名標_東京駅_東北新幹線.jpg", "東京駅 駅名標(新幹線)"],
        # --------------------------------------
        ["13_東京都/駅名標_東京駅_在来線_地下ホーム.jpg", "東京駅 駅名標(在来線)"],
        ["../trainCar/13_東京都/東京駅_E217系.jpg", "総武快速線 東京駅-->千葉駅"],
        ["12_千葉県/駅名標_千葉駅_総武本線.jpg", "千葉駅 駅名標"],
        # =================================================
        ["12_千葉県/駅舎_千葉駅.jpg", "千葉駅 駅舎"]
    ]
]

tohoku_ou_stations = [
    [35.61325000000000, 140.11336100000000, "千葉駅"],
    [35.68104166666667, 139.76721388888888, "東京駅"],
    [36.13629570000000, 139.69415550000000, "栗橋駅"],
    [36.19449650000000, 139.70965480000000, "古河駅"],
    [36.31348590000000, 139.80648110000000, "小山駅"],
    [36.55948020000000, 139.89848740000000, "宇都宮駅"],
    [36.74739020000000, 139.62213630000000, "日光駅"],
    [36.55948020000000, 139.89848740000000, "宇都宮駅"],
    [36.96989300000000, 140.05983700000000, "黒磯駅"],
    [37.12251900000000, 140.18814600000000, "新白河駅"],
    [37.13030780000000, 140.21251400000000, "白河駅"],
    [37.39823611111111, 140.38832222222223, "郡山駅"],
    [37.58956900000000, 140.43536400000000, "二本松駅"],
    [37.75460555555556, 140.45999166666667, "福島駅"],
    [38.25924166666667, 140.88180555555556, "仙台駅"],
    [38.37984200000000, 141.06610000000000, "松島駅"],
    [38.54140100000000, 141.06423300000000, "小牛田駅"],
    [38.92628600000000, 141.13742100000000, "一ノ関駅"],
    [38.98804800000000, 141.11749600000000, "平泉駅"],
    [39.28147700000000, 141.12221100000000, "北上駅"],
    [39.70152777777778, 141.13717777777777, "盛岡駅"],
    [40.26009900000000, 141.28623800000000, "二戸駅"],
    [40.50942200000000, 141.43098500000000, "八戸駅"],
    [40.82905277777778, 140.73306388888890, "青森駅"],
    [40.59898800000000, 140.48498100000000, "弘前駅"],
    [39.71662777777778, 140.12974444444444, "秋田駅"],
    [39.46545500000000, 140.47959300000000, "大曲駅"],
    [39.31027500000000, 140.56058800000000, "横手駅"],
    [38.76240200000000, 140.30600000000000, "新庄駅"],
    [38.24866100000000, 140.32754500000000, "山形駅"],
    [38.04742900000000, 140.14898200000000, "赤湯駅"],
    [37.90955900000000, 140.12808700000000, "米沢駅"],
    [37.75460555555556, 140.45999166666667, "福島駅"],
    [38.25924166666667, 140.88180555555556, "仙台駅"],
    [36.55210200000000, 140.63236000000000, "常陸多賀駅"],
    [36.37081900000000, 140.47619900000000, "水戸駅"],
    [35.68104166666667, 139.76721388888888, "東京駅"],
    [35.61325000000000, 140.11336100000000, "千葉駅"],
]
