tohoku_ou = [
    # ================= 切符 =================
    ["令和4年3月1日-令和4年3月3日", "総武本線・東北本線経由乗車券 東千葉->陸前山王"],
    ["令和4年3月3日-令和4年3月8日", "東北本線・IGRいわて銀河鉄道線・青い森鉄道線・奥羽本線・東北新幹線・東北本線・常磐線・東北本線・総武本線経由乗車券 陸前山王->東千葉"],
    ["令和4年3月1日", "日光線経由乗車券 宇都宮->日光(往復(ゆき))"],
    ["令和4年3月1日", "日光線経由乗車券 日光->宇都宮(往復(かえり))"],
    ["令和4年3月5日", "特急つがる2号自由席特急券 弘前->秋田"],
    ["令和4年3月5日", "秋田新幹線こまち28号立席特急券 秋田->大曲"],
    ["令和4年3月5日", "山形新幹線つばさ156号自由席特急券 新庄->山形"],
    ["令和4年3月6日", "山形新幹線つばさ132号自由席特急券 山形->赤湯"],
    ["令和4年3月6日", "山形新幹線つばさ142号自由席特急券 米沢->福島"],
    ["令和4年3月6日", "東北新幹線やまびこ61号自由席特急券 福島->仙台"],
    ["令和4年3月7日", "特急ひたち14号指定席特急券 仙台->常陸多賀"],
    ["令和4年3月8日", "特急ひたち8号指定席特急券 水戸->東京"],
    ["令和4年3月1日", "東武バス中禅寺温泉フリーパス"],
    ["令和4年3月1日", "日光東照宮拝観券"],
    ["令和4年3月1日", "華厳滝エレベーター大人昇降券"],
    ["令和4年3月3日", "るーぷる仙台・地下鉄共通1日乗車券"],
    ["令和4年3月3日", "福浦橋通行券"],
    # ================= 食事 =================
    ["令和4年3月2日", "仙台駅 牛たん弁当 1/2"],
    ["令和4年3月2日", "仙台駅 牛たん弁当 2/2"],
    ["令和4年3月5日", "秋田駅 しらかみネギそば"],
    ["令和4年3月5日", "山形駅 牛肉どまん中 1/2"],
    ["令和4年3月5日", "山形駅 牛肉どまん中 2/2"],
    ["令和4年3月6日", "米沢駅 天ぷらうどん"]
]
