from .station_list import *

hokuriku = [
    # ================= 乗車券 =================
    ["令和5年3月29日", "総武本線・上越新幹線経由乗車券 東千葉->新潟"],
    ["令和5年3月30日", "信越本線経由乗車券 新潟->直江津"],
    ["令和5年3月30日", "えちごトキめき鉄道日本海ひすいライン・あいの風とやま鉄道経由乗車券 直江津->富山"],
    ["令和5年3月31日", "あいの風とやま鉄道経由乗車券 富山->高岡"],
    ["令和5年3月31日", "あいの風とやま鉄道・IRいしかわ鉄道経由乗車券 高岡->金沢"],
    ["令和5年4月1日-令和5年4月2日", "北陸本線・東海道本線・東海道新幹線・総武本線経由乗車券 金沢->東千葉"],
    # ================= 特急券 =================
    ["令和5年3月29日", "上越新幹線とき311号自由席特急券 東京->新潟"],
    ["令和5年3月30日", "特急しらゆき4号自由席特急券 長岡->柏崎"],
    ["令和5年4月2日", "東海道新幹線ひかり652号自由席特急券 名古屋->東京"],
    # ================= 入場券 =================
    ["令和5年3月29日", "旧齋藤家別邸 観覧券"],
    ["令和5年3月31日", "富山地方鉄道 市内電車・バス１日フリーきっぷ"],
    ["令和5年3月31日", "北前船廻船問屋 森家 観覧券"],
    ["令和5年3月31日", "金沢市内１日フリー乗車券"],
    ["令和5年4月1日", "金沢市内１日フリー乗車券"],
    ["令和5年3月30日", "富山おみやげポイント 2000円"],
    ["令和5年3月31日", "石川県観光クーポン 2000円"],
    ["令和5年4月1日", "ふくいdeお得クーポン 1000円"],
    # ================= 食事 =================
    ["令和5年3月29日", "新潟駅 まさかいくらなんでも寿司 1/2"],
    ["令和5年3月29日", "新潟駅 まさかいくらなんでも寿司 2/2"],
    ["令和5年3月30日", "富山駅 ますのすし 1/2"],
    ["令和5年3月30日", "富山駅 ますのすし 2/2"],
    ["令和5年3月31日", "金沢駅 金沢三昧 1/2"],
    ["令和5年3月31日", "金沢駅 金沢三昧 2/2"],
    ["令和5年4月1日", "金沢駅 近江町市場 ホタテ串"],
    ["令和5年4月2日", "敦賀駅 羽二重餅 1/2"],
    ["令和5年4月2日", "敦賀駅 羽二重餅 2/2"]
]

hokuriku_images = [
    "令和5年3月29日~令和5年4月2日 北陸旅行",
    [
        # =================================================
        ["../trainCar/NoImage.jpg", "開発中"],
    ]
]

hokuriku_stations = [
    Chiba,       Tokyo,         Niigata,     Niitsu,     Nagaoka,
    Kashiwazaki, Naoetsu,       Itoigawa,    Oyashirazu, Tomari,
    Toyama,      Marunouchi,    Sakurabashi, Toyama,     Higashi_Iwase,
    Iwasehama,   Higashi_Iwase, Toyama,      Takaoka,    Kanazawa,
    Fukui,       Tsuruga,       Omi_Shiotsu, Nagahama,   Maibara,
    Ogaki,       Gifu,          Nagoya,      Tokyo,      Chiba,
]
