from .station_list import *

internship = [
    # ========================================================
    # ================= 乗車券 =================
    ["令和5年8月9日", "総武本線・中央東線経由乗車券 千葉->新宿(往復(ゆき))"],
    ["令和5年8月10日", "中央東線・総武本線経由乗車券 新宿->千葉(往復(かえり))"],
    # ================= 特急券 =================
    # ================= 入場券 =================
    # ================= 食事 =================
    # ========================================================
    # ================= 乗車券 =================
    ["令和5年8月24日", "総武本線・東海道山陽新幹線経由乗車券 東千葉->姫路(往復(ゆき))"],
    ["令和5年8月25日", "山陽本線・東海道本線・東海道新幹線・総武本線経由乗車券 姫路->東千葉(往復(かえり))"],
    # ================= 特急券 =================
    ["令和5年8月24日", "東海道山陽新幹線のぞみ81号自由席特急券 東京->姫路"],
    ["令和5年8月25日", "東海道新幹線のぞみ468号自由席特急券 新大阪->東京"],
    # ================= 入場券 =================
    # ================= 食事 =================
    # ========================================================
    # ================= 乗車券 =================
    ["令和5年9月20日", "総武本線・中央東線・篠ノ井線経由乗車券 東千葉->広丘(往復(ゆき))"],
    ["令和5年9月20日", "篠ノ井線・中央東線・総武本線経由乗車券 広丘->東千葉(往復(かえり))"],
    # ================= 特急券 =================
    ["令和5年9月20日", "特急あずさ50号(千葉あずさ)指定席特急券 塩尻->千葉"],
    # ================= 入場券 =================
    # ================= 食事 =================
]

internship_images = [
    "令和5年8月9日~令和5年9月20日 インターンシップ",
    [
        # =================================================
        ["../trainCar/NoImage.jpg", "開発中"],
    ]
]

internship_stations = [
    [Chiba, Tokyo, Chiba]
]
