from .station_list import *

nara = [
    # ================= 乗車券 =================
    ["令和5年11月21日", "総武本線・東海道新幹線・奈良線・関西本線経由乗車券 東千葉->法隆寺(往復(ゆき))"],
    ["令和5年11月22日", "関西本線・奈良線・東海道新幹線・総武本線経由乗車券 法隆寺->東千葉(往復(かえり))"],
    # ================= 特急券 =================
    ["令和5年11月21日", "東海道新幹線のぞみ325号自由席特急券 東京->京都"],
    ["令和5年11月22日", "東海道新幹線のぞみ152号自由席特急券 京都->東京"],
    # ================= 入場券 =================
    # ================= 食事 =================
    ["令和5年11月22日", "柿の葉すし本舗たなか 柿の葉すし 炙りサーモン 1/3"],
    ["令和5年11月22日", "柿の葉すし本舗たなか 柿の葉すし 炙りサーモン 2/3"],
    ["令和5年11月22日", "柿の葉すし本舗たなか 柿の葉すし 炙りサーモン 3/3"],
]

nara_images = [
    "令和5年11月21日~令和5年11月22日 奈良旅行",
    [
        # =================================================
        ["../trainCar/NoImage.jpg", "開発中"],
    ]
]

nara_stations = [
    # ============================ R5/11/21 ============================
    [Chiba, Tokyo, Kyoto, MukoMachi, Kyoto, Nara, Shin_Omiya],
    # ============================ R5/11/22 ============================
    [Shin_Omiya, Yamato_Saidaiji, Shin_Omiya, Kintetsu_Nara, Nara, Kyoto, Tokyo, Chiba]
]
