kyuusyu = [
    # ================= 乗車券 =================
    ["令和6年10月15日", "総武本線・成田線経由乗車券 千葉->空港第2ビル"],
    ["令和6年10月15日", "福岡市地下鉄乗車券 福岡空港->博多"],
    ["令和6年10月15日", "鹿児島本線・長崎本線・佐世保線・西九州新幹線経由乗車券 博多->長崎"],
    ["令和6年10月15日-令和6年10月19日", "長崎本線・大村線・佐世保線・長崎本線・九州新幹線・山陽新幹線・鹿児島本線・日豊本線・日南線経由乗車券 長崎->日南"],
    ["令和6年10月16日", "佐世保線経由乗車券 早岐->佐世保(往復(ゆき))"],
    ["令和6年10月16日", "佐世保線経由乗車券 佐世保->早岐(往復(かえり))"],
    ["令和6年10月17日", "鹿児島本線経由乗車券 小倉->西小倉"],
    ["令和6年10月19日", "日南線・日豊本線経由乗車券 青島->宮崎"],
    ["令和6年10月19日", "日豊本線・日南線・宮崎空港線経由乗車券 宮崎->宮崎空港"],
    ["令和6年10月19日", "成田線・総武本線経由乗車券 空港第2ビル->東千葉"],
    # ================= 特急券 =================
    # ================= 入場券 =================
    # ================= 食事 =================
]
