kyuusyu = [
    # ================= 乗車券 =================
    ["令和6年10月15日", "総武本線・成田線経由乗車券 千葉->空港第2ビル"],
    ["令和6年10月15日", "福岡市地下鉄乗車券 福岡空港->博多"],
    ["令和6年10月15日", "鹿児島本線・長崎本線・佐世保線・西九州新幹線経由乗車券 博多->長崎"],
    ["令和6年10月15日-令和6年10月19日", "長崎本線・大村線・佐世保線・長崎本線・九州新幹線・山陽新幹線・鹿児島本線・日豊本線・日南線経由乗車券 長崎->日南"],
    ["令和6年10月16日", "佐世保線経由乗車券 早岐->佐世保(往復(ゆき))"],
    ["令和6年10月16日", "佐世保線経由乗車券 佐世保->早岐(往復(かえり))"],
    ["令和6年10月17日", "鹿児島本線経由乗車券 小倉->西小倉"],
    ["令和6年10月19日", "日南線・日豊本線経由乗車券 青島->宮崎"],
    ["令和6年10月19日", "日豊本線・日南線・宮崎空港線経由乗車券(特急にちりんシーガイア5号) 宮崎->宮崎空港"],
    ["令和6年10月19日", "成田線・総武本線経由乗車券 空港第2ビル->東千葉"],
    # ================= 特急券 =================
    ["令和6年10月15日", "特急リレーかもめ25号指定席特急券 博多->武雄温泉"],
    ["令和6年10月15日", "西九州新幹線かもめ25号指定席特急券 武雄温泉->長崎"],
    ["令和6年10月16日", "特急みどり36号自由席特急券 早岐->武雄温泉"],
    ["令和6年10月16日", "特急リレーかもめ42号自由席特急券 武雄温泉->佐賀"],
    ["令和6年10月17日", "九州新幹線つばめ312号・山陽新幹線さくら550号自由席特急券 新鳥栖->小倉"],
    ["令和6年10月17日", "特急ソニック19号自由席特急券 小倉->別府"],
    ["令和6年10月18日", "特急にちりん7号自由席特急券 臼杵->延岡"],
    ["令和6年10月18日", "特急ひゅうが11号自由席特急券 延岡->佐土原"],
    # ================= 航空券 =================
    ["令和6年10月15日", "GK505 成田国際空港(NRT)->福岡空港(FUK)"],
    ["令和6年10月19日", "GK636 宮崎空港(KMI)->成田国際空港(NRT)"],
    # ================= 入場券 =================
    ["令和6年10月15日", "長崎電気軌道 24時間乗車券"],
    ["令和6年10月15日", "出島入場券"],
    ["令和6年10月15日", "大浦天主堂拝観券"],
    ["令和6年10月15日", "グラバー園入場券"],
    ["令和6年10月15日", "長崎ロープウェイ団体分乗券(往復)"],
    ["令和4年10月16日", "日本本土四極最西端到達証明書"],
    ["令和4年10月17日", "吉野ヶ里歴史公園 利用券"],
    ["令和4年10月17日", "別府地獄めぐり 定期観光バス"],
    # ================= 食事 =================
]
