from .station_list import *

okinawa = [
    # ================= 乗車券 =================
    ["令和6年11月05日", "総武本線・成田線経由乗車券 千葉->成田空港"],
    ["令和6年11月05日", "沖縄都市モノレール(ゆいレール) 那覇空港->美栄橋"],
    ["令和6年11月07日", "沖縄都市モノレール(ゆいレール) 1日乗車券"],
    ["令和6年11月07日", "成田線・総武本線経由乗車券 空港第2ビル->千葉"],
    # ================= 航空券 =================
    ["令和6年11月05日", "GK331 成田国際空港(NRT)->那覇空港(OKA)"],
    ["令和6年11月07日", "GK334 那覇空港(OKA)->成田国際空港(NRT)"],
    # ================= 特急券 =================
    # ================= 入場券 =================
    ["令和6年11月06日", "万座毛観覧券"],
    ["令和6年11月06日", "ナゴパイナップルパーク入園券"],
    ["令和6年11月06日", "沖縄美ら海水族館入館券"],
    ["令和6年11月07日", "首里城公園入園券"],
    ["令和6年11月07日", "首里城公園来園記念"],
    ["令和6年11月07日", "福州園観覧券"],
    # ================= 食事 =================
    ["令和6年11月05日", "沖縄そば"],
    ["令和6年11月06日", "サーターアンダーギー"],
    ["令和6年11月06日", "泡盛"],
    ["令和6年11月07日", "A&Wモッツァバーガー"],
    ["令和6年11月07日", "ソーキそば"],
    ["令和6年11月07日", "ちんすこう"],
    ["令和6年11月07日", "アーモンドチョコレートサンド紅いも"],
    ["令和6年11月07日", "紅いもタルト"],
    ["令和6年11月07日", "ちんすこう"],
]

okinawa_images = [
    "令和6年11月05日~令和6年11月07日 沖縄旅行",
    [
        # =================================================
        ["../trainCar/NoImage.jpg", "開発中"],
    ]
]

okinawa_stations = [Chiba, Tokyo, Chiba]
