from .station_list import *

sanin = [
    # ================= 乗車券 =================
    ["令和6年3月1日-令和6年3月3日", "総武本線・東海道新幹線・山陰本線経由乗車券 東千葉->出雲市"],
    ["令和6年3月1日", "京都丹後鉄道宮福線・宮豊線経由乗車券 福知山->天橋立"],
    ["令和6年3月1日", "京都丹後鉄道宮豊線・宮福線経由乗車券 天橋立->福知山"],
    ["令和6年3月4日", "一畑電車北松江線・大社線経由乗車券 電鉄出雲市->出雲大社前"],
    ["令和6年3月4日", "一畑電車大社線・北松江線経由乗車券 出雲大社前->電鉄出雲市"],
    ["令和6年3月4日", "山陰本線・伯備線・山陽本線・山陽東海道新幹線・総武本線経由乗車券 出雲市->東千葉"],
    # ================= 特急券 =================
    ["令和6年3月1日", "東海道新幹線のぞみ209号自由席特急券 東京->京都"],
    ["令和6年3月1日", "特急はしだて5号指定席特急券 京都->天橋立"],
    ["令和6年3月2日", "特急きのさき1号指定席特急券 福知山->城崎温泉"],
    ["令和6年3月3日", "特急スーパーまつかぜ5号自由席特急券 鳥取->米子"],
    ["令和6年3月4日", "特急やくも16号自由席特急券 出雲市->岡山"],
    ["令和6年3月4日", "東海道新幹線のぞみ100号自由席特急券 岡山->東京"],
    # ================= 入場券 =================
    ["令和6年3月1日", "天橋立ビューランド リフト・モノレール往復共通券"],
    ["令和6年3月2日", "城崎温泉ロープウェイ 山頂駅往復乗車券"],
    ["令和6年3月3日", "松江城 登閣券"],
    # ================= 食事 =================
    ["令和6年3月2日", "城崎温泉駅 城崎名物 かにめしとすきやき弁当 1/2"],
    ["令和6年3月2日", "城崎温泉駅 城崎名物 かにめしとすきやき弁当 2/2"],
    ["令和6年3月2日", "鳥取駅 元祖かに寿し 1/2"],
    ["令和6年3月2日", "鳥取駅 元祖かに寿し 2/2"],
    ["令和6年3月3日", "鳥取駅 砂丘そば"],
    ["令和6年3月3日", "出雲市駅 かに寿し 1/2"],
    ["令和6年3月3日", "出雲市駅 かに寿し 2/2"],
    ["令和6年3月4日", "出雲市駅 島根牛すき焼きもろみ丼 1/2"],
    ["令和6年3月4日", "出雲市駅 島根牛すき焼きもろみ丼 2/2"],
    ["令和6年3月4日", "山陰の味　大風呂敷 1/2"],
    ["令和6年3月4日", "山陰の味　大風呂敷 2/2"],
]

sanin_images = [
    "令和6年3月1日~令和6年3月4日 山陰旅行",
    [
        # =================================================
        ["../trainCar/NoImage.jpg", "開発中"],
    ]
]

sanin_stations = [Chiba, Tokyo, Chiba]
