from .station_list import *

kii = [
    # ================= 乗車券 =================
    ["令和7年11月24日-令和7年11月28日", "篠ノ井線・中央西線・東海道本線・関西本線・紀勢本線・和歌山線・関西本線・奈良線・東海道新幹線経由乗車券 広丘->名古屋(連続1)"],
    ["令和7年11月28日", "東海道本線・中央西線・篠ノ井線経由乗車券 名古屋->塩尻(連続2)"],
    ["令和7年11月24日", "紀勢本線・参宮線経由乗車券 松阪->伊勢市(往復(ゆき))"],
    ["令和7年11月24日", "参宮線・紀勢本線経由乗車券 伊勢市->松阪(往復(かえり))"],
    ["令和7年11月26日", "紀勢本線経由乗車券 和歌山->和歌山市"],
    # ================= 特急券 =================
    ["令和7年11月24日", "特急しなの2号指定席特急券 塩尻->名古屋"],
    ["令和7年11月25日", "特急南紀1号指定席特急券 松阪->紀伊勝浦"],
    ["令和7年11月25日", "特急くろしお30号指定席特急券 紀伊勝浦->白浜"],
    ["令和7年11月26日", "特急くろしお24号指定席特急券 白浜->和歌山"],
    ["令和7年11月28日", "東海道新幹線ひかり510号自由席特急券 京都->名古屋"],
    ["令和7年11月28日", "特急しなの19号指定席特急券 名古屋->塩尻"],
    ["令和7年11月28日", "特急しなの17号指定席特急券 名古屋->塩尻"],
    # ================= 入場券 =================
    ["令和7年11月25日", "熊野御坊南海バス バス乗車券"],
    ["令和7年11月27日", "高野山・世界遺産きっぷ"],
    ["令和7年11月27日", "南海電鉄高野線・高野山ケーブルカー経由乗車券 橋本->高野山"],
    ["令和7年11月27日", "高野山ケーブルカー・南海電鉄高野線経由乗車券 高野山->橋本"],
    ["令和7年11月27日", "高野山内フリー乗車券 高野山駅前<->奥の院前・大門"],
    ["令和7年11月24日", "式年遷宮記念せんぐう館 入館証"],
    ["令和7年11月25日", "飛瀧神社延命御守"],
    ["令和7年11月26日", "三段壁洞窟 入場券"],
    ["令和7年11月26日", "和歌山城 入場券"],
    ["令和7年11月27日", "金剛峯寺金堂 入場券"],
    ["令和7年11月27日", "金剛峯寺 内拝券"],
    ["令和7年11月28日", "法隆寺 一般参拝券"],
    ["令和7年11月28日", "東大寺 大仏殿 入場券"],
    # ================= 食事 =================
    ["令和7年11月24日", "伊勢市駅 赤福"],
    ["令和7年11月24日", "伊勢市駅 伊勢うどん"],
    ["令和7年11月24日", "松阪駅 モー太郎弁当 1/2"],
    ["令和7年11月24日", "松阪駅 モー太郎弁当 2/2"],
    ["令和7年11月28日", "京都駅 八つ橋"],
    ["令和7年11月28日", "奈良駅 ならっこクッキー"],
]

kii_images = [
    "令和7年11月24日~令和7年11月28日 紀伊半島一周旅行",
    [
        # =================================================
        ["../trainCar/NoImage.jpg", "開発中"],
    ]
]

kii_stations = [
    # ============================ R7/11/24 ============================
    [Minami_Matsumoto, Shiojiri, Nagoya, Yokkaichi, Kameyama, Tsu, Matsusaka, Iseshi, Matsusaka],
    # ============================ R7/11/25 ============================
    [Matsusaka, Kii_Katsuura, Shirahama],
    # ============================ R7/11/26 ============================
    [Shirahama, Wakayama, Wakayamashi, Wakayama],
    # ============================ R7/11/27 ============================
    [Wakayama, Hashimoto, Gokurakubashi, Koyasan, Gokurakubashi, Hashimoto, Gojou, Ouji],
    # ============================ R7/11/28 ============================
    [Ouji, Houryuuji, Nara, Joyo, Kyoto, Nagoya, Shiojiri, Minami_Matsumoto],
]
