from .station_list import *

nakasendo = [
    # ================= 乗車券 =================
    ["令和7年8月12日-令和7年8月14日", "篠ノ井線・中央西線・東海道本線・奈良線経由乗車券 南松本->宇治(往復(ゆき))"],
    ["令和7年8月13日", "犬山城下町きっぷ 名鉄名古屋本線・名鉄犬山線経由乗車券 名鉄名古屋->犬山遊園"],
    ["令和7年8月13日", "犬山城下町きっぷ 名鉄犬山線・名鉄名古屋本線経由乗車券 犬山遊園->名鉄名古屋"],
    ["令和7年8月14日", "京阪電車 びわ湖1日観光チケット"],
    ["令和7年8月14日", "奈良線・東海道本線・中央西線・篠ノ井線経由乗車券 宇治->南松本(往復(かえり))"],
    # ================= 特急券 =================
    ["令和7年8月14日", "東海道新幹線のぞみ388号指定席特急券 京都->名古屋"],
    ["令和7年8月14日", "特急しなの21号指定席特急券 名古屋->塩尻"],
    ["令和7年8月14日", "特急しなの17号指定席特急券 名古屋->塩尻"],
    # ================= 入場券 =================
    ["令和7年8月13日", "犬山城下町きっぷ 犬山城入場券引換券"],
    ["令和7年8月13日", "国宝犬山城 入場登閣券"],
    ["令和7年8月13日", "清洲城 入場券"],
    ["令和7年8月13日", "彦根城 入場券"],
    ["令和7年8月14日", "平等院 拝観券"],
    ["令和7年8月14日", "京都タワー 入場券"],
    # ================= 食事 =================
    ["令和7年8月12日", "中津川駅 食事処平和 かつ丼"],
    ["令和7年8月12日", "名古屋駅 矢場とん 味噌カツ"],
    ["令和7年8月13日", "草津駅 近江牛焼肉弁当 1/2"],
    ["令和7年8月13日", "草津駅 近江牛焼肉弁当 2/2"],
    ["令和7年8月13日", "草津駅 うばがもち 1/3"],
    ["令和7年8月13日", "草津駅 うばがもち 2/3"],
    ["令和7年8月13日", "草津駅 うばがもち 3/3"],
    ["令和7年8月14日", "京都駅 しゃかりき 醤油ラーメン"],
]

nakasendo_images = [
    "令和7年8月12日~令和7年8月14日 中山道",
    [
        # =================================================
        ["../trainCar/NoImage.jpg", "開発中"],
    ]
]

nakasendo_stations = [
    # ============================ R7/08/12 ============================
    [Minami_Matsumoto, Shiojiri, Agematsu, Nagiso, Nakatsugawa, Tajimi, Kanayama, Jingumae, Kanayama, Nagoya, Hisaya_Odori, Sakae],
    # ============================ R7/08/13 ============================
    [Sakae, Nagoya, Meitetsu_Nagoya, Inuyama_Yuen, Meitetsu_Nagoya, Nagoya, Kiyosu, Owari_Ichinomiya, Ogaki, Maibara, Hikone, Kusatsu, Minami_Kusatsu],
    # ============================ R7/08/14 ============================
    [Minami_Kusatsu, Otsu, Yamashina, Otani, Biwako_Hamaotsu, Miidera, Biwako_Hamaotsu, Otani, Yamashina, Kyoto, Uji, Kyoto, Maibara, Nagoya, Kanayama, Tajimi, Nakatsugawa, Nagiso, Agematsu, Shiojiri, Minami_Matsumoto]
]
