from .station_list import *

nakasendo = [
    # ================= 乗車券 =================
    ["令和7年8月12日-令和7年8月14日", "篠ノ井線・中央西線・東海道本線・奈良線経由乗車券 南松本->宇治(往復(ゆき))"],
    ["令和7年8月13日", "犬山城下町きっぷ 名鉄名古屋本線・名鉄犬山線経由乗車券 名鉄名古屋->犬山遊園"],
    ["令和7年8月13日", "犬山城下町きっぷ 名鉄犬山線・名鉄名古屋本線経由乗車券 犬山遊園->名鉄名古屋"],
    ["令和7年8月14日", "京阪電車 びわ湖1日観光チケット"],
    ["令和7年8月14日", "奈良線・東海道本線・中央西線・篠ノ井線経由乗車券 宇治->南松本(往復(かえり))"],
    # ================= 特急券 =================
    ["令和7年8月14日", "東海道新幹線のぞみ388号指定席特急券 京都->名古屋"],
    ["令和7年8月14日", "特急しなの21号指定席特急券 名古屋->塩尻"],
    ["令和7年8月14日", "特急しなの17号指定席特急券 名古屋->塩尻"],
    # ================= 入場券 =================
    ["令和7年8月13日", "犬山城下町きっぷ 犬山城入場券引換券"],
    ["令和7年8月13日", "国宝犬山城 入場登閣券"],
    ["令和7年8月13日", "清洲城 入場券"],
    ["令和7年8月13日", "彦根城 入場券"],
    ["令和7年8月14日", "平等院 拝観券"],
    ["令和7年8月14日", "京都タワー 入場券"],
    # ================= 食事 =================
    ["令和7年8月12日", "中津川駅 食事処平和 かつ丼"],
    ["令和7年8月12日", "名古屋駅 矢場とん 味噌カツ"],
    ["令和7年8月13日", "草津駅 近江牛焼肉弁当 1/2"],
    ["令和7年8月13日", "草津駅 近江牛焼肉弁当 2/2"],
    ["令和7年8月13日", "草津駅 うばがもち 1/3"],
    ["令和7年8月13日", "草津駅 うばがもち 2/3"],
    ["令和7年8月13日", "草津駅 うばがもち 3/3"],
    ["令和7年8月14日", "京都駅 しゃかりき 醤油ラーメン"],
]

nakasendo_images = [
    "令和7年8月12日~令和7年8月14日 中山道",
    [
        # =================================================
        ["20_長野県/駅名標_南松本駅.jpg", "南松本駅 駅名標"],
        ["20_長野県/駅舎_南松本駅.jpg", "南松本駅 駅舎"],
        # =================================================
        ["20_長野県/駅名標_上松駅.jpg", "上松駅 駅名標"],
        ["20_長野県/駅舎_上松駅.jpg", "上松駅 駅舎"],
        ["20_長野県/寝覚の床.jpg", "寝覚の床"],
        # =================================================
        ["20_長野県/駅名標_南木曽駅.jpg", "南木曽駅 駅名標"],
        ["20_長野県/駅舎_南木曽駅.jpg", "南木曽駅 駅舎"],
        ["20_長野県/妻籠宿.jpg", "妻籠宿"],
        # =================================================
        ["21_岐阜県/駅名標_中津川駅.jpg", "中津川駅 駅名標"],
        ["21_岐阜県/駅舎_中津川駅.jpg", "中津川駅 駅舎"],
        ["21_岐阜県/中津川宿.jpg", "中津川宿"],
        # =================================================
        ["21_岐阜県/駅名標_多治見駅.jpg", "多治見駅 駅名標"],
        ["21_岐阜県/駅舎_多治見駅.jpg", "多治見駅 駅舎"],
        ["21_岐阜県/虎渓用水広場.jpg", "虎渓用水広場宿"],
        # =================================================
        ["23_愛知県/駅名標_金山駅.jpg", "金山駅 駅名標"],
        ["23_愛知県/駅舎_金山駅.jpg", "金山駅 駅舎"],
        ["23_愛知県/駅名標_金山駅_名古屋鉄道.jpg", "金山駅 駅名標"],
        # =================================================
        ["23_愛知県/駅名標_神宮前駅.jpg", "神宮前駅 駅名標"],
        ["23_愛知県/駅舎_神宮前駅.jpg", "神宮前駅 駅舎"],
        ["23_愛知県/熱田神宮.jpg", "熱田神宮"],
        # =================================================
        ["23_愛知県/駅名標_金山駅_名古屋鉄道.jpg", "金山駅 駅名標"],
        ["23_愛知県/駅舎_金山駅.jpg", "金山駅 駅舎"],
        ["23_愛知県/駅名標_金山駅.jpg", "金山駅 駅名標"],
        # =================================================
        ["23_愛知県/駅名標_名古屋駅_在来線.jpg", "名古屋駅 駅名標"],
        ["23_愛知県/駅舎_名古屋駅.jpg", "名古屋駅 駅舎"],
        ["23_愛知県/駅名標_名古屋駅_名古屋市営地下鉄.jpg", "名古屋駅 駅名標"],
        # =================================================
        ["23_愛知県/駅名標_久屋大通駅.jpg", "久屋大通駅 駅名標"],
        ["23_愛知県/名古屋.jpg", "名古屋テレビ塔"],
        ["23_愛知県/駅名標_栄駅.jpg", "栄駅 駅名標"],
        # =================================================
        ["23_愛知県/駅名標_名古屋駅_名古屋市営地下鉄.jpg", "名古屋駅 駅名標"],
        ["23_愛知県/駅名標_名鉄名古屋駅.jpg", "名鉄名古屋駅 駅名標"],
        # =================================================
        ["23_愛知県/駅名標_犬山遊園駅.jpg", "犬山遊園駅 駅名標"],
        ["23_愛知県/駅舎_犬山遊園駅.jpg", "犬山遊園駅 駅舎"],
        ["23_愛知県/犬山城.jpg", "犬山城"],
        # =================================================
        ["23_愛知県/駅名標_名鉄名古屋駅.jpg", "名鉄名古屋駅 駅名標"],
        ["23_愛知県/駅名標_名古屋駅_在来線.jpg", "名古屋駅 駅名標"],
        # =================================================
        ["23_愛知県/駅名標_清洲駅.jpg", "清洲駅 駅名標"],
        ["23_愛知県/駅舎_清洲駅.jpg", "清洲駅 駅舎"],
        ["23_愛知県/清洲城.jpg", "清洲城"],
        # =================================================
        ["23_愛知県/駅名標_尾張一宮駅.jpg", "尾張一宮駅 駅名標"],
        # =================================================
        ["21_岐阜県/駅名標_大垣駅.jpg", "大垣駅 駅名標"],
        ["21_岐阜県/駅舎_大垣駅.jpg", "大垣駅 駅舎"],
        ["21_岐阜県/水都大垣_集いの泉.jpg", "水都大垣_集いの泉"],
        # =================================================
        ["25_滋賀県/駅名標_米原駅.jpg", "米原駅 駅名標"],
        # =================================================
        ["25_滋賀県/駅名標_彦根駅.jpg", "彦根駅 駅名標"],
        ["25_滋賀県/駅舎_彦根駅.jpg", "彦根駅 駅舎"],
        ["25_滋賀県/彦根城.jpg", "彦根城"],
        # =================================================
        ["25_滋賀県/駅名標_草津駅.jpg", "草津駅 駅名標"],
        ["25_滋賀県/駅舎_草津駅.jpg", "草津駅 駅舎"],
        # =================================================
        ["25_滋賀県/駅名標_南草津駅.jpg", "南草津駅 駅名標"],
        ["25_滋賀県/駅舎_南草津駅.jpg", "南草津駅 駅舎"],
        # =================================================
        ["25_滋賀県/駅名標_大津駅.jpg", "大津駅 駅名標"],
        ["25_滋賀県/駅舎_大津駅.jpg", "大津駅 駅舎"],
        # =================================================
        ["26_京都府/駅名標_山科駅.jpg", "山科駅 駅名標"],
        ["26_京都府/駅舎_山科駅.jpg", "山科駅 駅舎"],
        # =================================================
        ["26_京都府/駅名標_京阪山科駅.jpg", "京阪山科駅 駅名標"],
        ["26_京都府/駅舎_京阪山科駅.jpg", "京阪山科駅 駅舎"],
        # =================================================
        ["25_滋賀県/駅名標_大谷駅.jpg", "大谷駅 駅名標"],
        ["25_滋賀県/駅舎_大谷駅.jpg", "大谷駅 駅舎"],
        ["25_滋賀県/逢坂関.jpg", "逢坂関"],
        # =================================================
        ["25_滋賀県/駅名標_びわ湖浜大津駅.jpg", "びわ湖浜大津駅 駅名標"],
        ["25_滋賀県/駅舎_びわ湖浜大津駅.jpg", "びわ湖浜大津駅 駅舎"],
        ["25_滋賀県/琵琶湖.jpg", "琵琶湖"],
        # =================================================
        ["25_滋賀県/駅名標_三井寺駅.jpg", "三井寺駅 駅名標"],
        ["25_滋賀県/駅舎_三井寺駅.jpg", "三井寺駅 駅舎"],
        ["25_滋賀県/琵琶湖疎水.jpg", "琵琶湖疎水"],
        # =================================================
        ["25_滋賀県/駅名標_びわ湖浜大津駅.jpg", "びわ湖浜大津駅 駅名標"],
        ["25_滋賀県/駅舎_びわ湖浜大津駅.jpg", "びわ湖浜大津駅 駅舎"],
        # =================================================
        ["26_京都府/駅名標_京阪山科駅.jpg", "京阪山科駅 駅名標"],
        ["26_京都府/駅舎_京阪山科駅.jpg", "京阪山科駅 駅舎"],
        # =================================================
        ["26_京都府/駅名標_山科駅.jpg", "山科駅 駅名標"],
        ["26_京都府/駅舎_山科駅.jpg", "山科駅 駅舎"],
        # =================================================
        ["26_京都府/駅名標_京都駅_東海道本線.jpg", "京都駅 駅名標"],
        ["26_京都府/駅舎_京都駅.jpg", "京都駅 駅舎"],
        ["26_京都府/駅名標_京都駅_奈良線.jpg", "京都駅 駅名標"],
        # =================================================
        ["26_京都府/駅名標_宇治駅.jpg", "宇治駅 駅名標"],
        ["26_京都府/駅舎_宇治駅.jpg", "宇治駅 駅舎"],
        ["26_京都府/平等院.jpg", "平等院"],
        # =================================================
        ["26_京都府/駅名標_京都駅_奈良線.jpg", "京都駅 駅名標"],
        ["26_京都府/京都タワー.jpg", "京都タワー"],
        ["26_京都府/駅名標_京都駅_新幹線.jpg", "京都駅 駅名標"],
        # =================================================
        ["23_愛知県/駅名標_名古屋駅_新幹線.jpg", "名古屋駅 駅名標"],
        ["23_愛知県/駅舎_名古屋駅.jpg", "名古屋駅 駅舎"],
        ["23_愛知県/駅名標_名古屋駅_在来線.jpg", "名古屋駅 駅名標"],
        # =================================================
        ["20_長野県/駅名標_塩尻駅.jpg", "塩尻駅 駅名標"],
        ["20_長野県/駅舎_塩尻駅.jpg", "塩尻駅 駅舎"],
        # =================================================
        ["20_長野県/駅名標_南松本駅.jpg", "南松本駅 駅名標"],
        ["20_長野県/駅舎_南松本駅.jpg", "南松本駅 駅舎"],
    ]
]

nakasendo_stations = [
    # ============================ R7/08/12 ============================
    [Minami_Matsumoto, Shiojiri, Agematsu, Nagiso, Nakatsugawa, Tajimi, Kanayama, Jingumae, Kanayama, Nagoya, Hisaya_Odori, Sakae],
    # ============================ R7/08/13 ============================
    [Sakae, Nagoya, Meitetsu_Nagoya, Inuyama_Yuen, Meitetsu_Nagoya, Nagoya, Kiyosu, Owari_Ichinomiya, Ogaki, Maibara, Hikone, Kusatsu, Minami_Kusatsu],
    # ============================ R7/08/14 ============================
    [Minami_Kusatsu, Otsu, Yamashina, Otani, Biwako_Hamaotsu, Miidera, Biwako_Hamaotsu, Otani, Yamashina, Kyoto, Uji, Kyoto, Maibara, Nagoya, Kanayama, Tajimi, Nakatsugawa, Nagiso, Agematsu, Shiojiri, Minami_Matsumoto]
]
