tohoku_uetsu = [
    # ================= 切符 =================
    ["令和7年2月25日-令和7年2月26日", "旅せよ平日! JR東日本たびキュン早割パス(2日間用)"],
    ["令和7年2月25日", "東北新幹線はやぶさ35号指定席特急券 仙台->新青森"],
    ["令和7年2月26日", "秋田新幹線こまち95号指定席特急券 盛岡->角館"],
    ["令和7年2月26日", "特急いなほ8号指定席特急券 秋田->酒田"],
    ["令和7年2月26日", "特急いなほ10号指定席特急券 酒田->新発田"],
    ["令和7年2月26日", "上越新幹線とき340号指定席特急券 新潟->東京"],
    # ================= 入場券 =================
    ["令和7年2月15日", "下呂発温泉博物館・白鷺乃湯入場券"],
    ["令和7年2月16日", "高山陣屋入場券"],
    ["令和7年2月16日", "和田家入場券"],
    ["令和7年2月17日", "富山市郷土博物館観覧券"],
    # ================= 食事 =================
    ["令和7年2月15日", "下呂駅 豆天狗 下呂温泉店 飛騨牛ラーメン"],
    ["令和7年2月15日", "高山駅 飛騨牛しぐれ寿司 1/2"],
    ["令和7年2月15日", "高山駅 飛騨牛しぐれ寿司 2/2"],
]
