from .station_list import *

takayama = [
    # ================= 乗車券 =================
    ["令和7年2月15日-令和7年2月17日", "総武本線・東海道新幹線・東海道本線・高山本線・北陸新幹線経由乗車券 東千葉->東京(連続1)"],
    ["令和7年2月17日", "総武本線経由乗車券 東京->東千葉(連続2)"],
    # ================= 特急券 =================
    ["令和7年2月15日", "東海道新幹線のぞみ311号自由席特急券 東京->名古屋"],
    ["令和7年2月15日", "特急ひだ7号自由席特急券 名古屋->下呂"],
    ["令和7年2月17日", "特急ひだ3号自由席特急券 飛騨古川->富山"],
    ["令和7年2月17日", "北陸新幹線かがやき510号指定席特急券 富山->東京"],
    # ================= 入場券 =================
    ["令和7年2月15日", "下呂発温泉博物館・白鷺乃湯入場券"],
    ["令和7年2月16日", "高山陣屋入場券"],
    ["令和7年2月16日", "和田家入場券"],
    ["令和7年2月17日", "富山市郷土博物館観覧券"],
    # ================= 食事 =================
    ["令和7年2月15日", "下呂駅 豆天狗 下呂温泉店 飛騨牛ラーメン"],
    ["令和7年2月15日", "高山駅 飛騨牛しぐれ寿司 1/2"],
    ["令和7年2月15日", "高山駅 飛騨牛しぐれ寿司 2/2"],
    ["令和7年2月16日", "白川郷 しらおぎ 味噌カツ丼"],
    ["令和7年2月17日", "富山駅 大喜 富山ブラック"],
    ["令和7年2月17日", "富山駅 ますのすし 1/2"],
    ["令和7年2月17日", "富山駅 ますのすし 2/2"],
    ["令和7年2月17日", "富山駅 皇国晴酒造 幻の瀧"],
    ["令和7年2月17日", "富山駅 しろえび紀行 1/2"],
    ["令和7年2月17日", "富山駅 しろえび紀行 2/2"],
]

takayama_images = [
    "令和7年2月15日~令和7年2月17日 高山本線",
    [
        # =================================================
        ["../trainCar/NoImage.jpg", "開発中"],
    ]
]

takayama_stations = [
    Chiba,       Tokyo,    Nagoya,        Gero,   Takayama,
    Shirakawago, Takayama, Hida_Furukawa, Toyama, Tokyo,
    Chiba,
]
