from .station_list import *

tottori = [
    # ============================ 松本==>鳥取 ============================
    # ================= 乗車券 =================
    ["令和7年5月25日", "篠ノ井線・中央西線・東海道山陽新幹線・山陽本線・智頭急行・因美線経由乗車券 南松本->鳥取"],
    # ================= 特急券 =================
    ["令和7年5月25日", "特急しなの8号指定席特急券 塩尻->名古屋"],
    ["令和7年5月25日", "東海道山陽新幹線のぞみ69号指定席特急券 名古屋->姫路"],
    ["令和7年5月25日", "特急スーパーはくと9号指定席特急券 姫路->鳥取"],
    # ================= 入場券 =================
    # ================= 食事 =================
    ["令和7年5月25日", "名古屋駅 名代きしめん 住よし きしめん"],
    ["令和7年5月25日", "鳥取駅 元祖かに寿し 1/2"],
    ["令和7年5月25日", "鳥取駅 元祖かに寿し 2/2"],
    # ============================ 鳥取 ============================
    # ================= 乗車券 =================
    ["令和7年6月1日", "山陰本線・境線経由乗車券 鳥取->境港(往復(ゆき))"],
    ["令和7年6月1日", "境線・山陰本線経由乗車券 境港->鳥取(往復(かえり))"],
    # ================= 特急券 =================
    ["令和7年6月1日", "特急スーパーまつかぜ3号自由席特急券 鳥取->米子"],
    ["令和7年6月1日", "特急スーパーおき4号自由席特急券 倉吉->鳥取"],
    # ================= 入場券 =================
    ["令和7年6月1日", "水木しげる記念館"],
    # ================= 食事 =================
    ["令和7年6月1日", "倉吉駅 鳥取二十世紀梨 ソフトキャンディ 1/2"],
    ["令和7年6月1日", "倉吉駅 鳥取二十世紀梨 ソフトキャンディ 2/2"],
    # ============================ 岡山・広島 ============================
    # ================= 乗車券 =================
    ["令和7年6月7日-令和7年6月8日", "因美線・姫新線・津山線・山陽本線・山陽新幹線・山陽本線経由乗車券 鳥取->宮島口"],
    ["令和7年6月8日", "山陽本線・山陽新幹線・山陽本線・智頭急行・因美線経由乗車券 宮島口->鳥取"],
    ["令和7年6月8日", "山陽本線・呉線経由乗車券 広島->呉(往復(ゆき))"],
    ["令和7年6月8日", "呉線・山陽本線経由乗車券 呉->広島(往復(かえり))"],
    # ================= 特急券 =================
    ["令和7年6月7日", "山陽新幹線こだま859号自由席特急券 三原->広島"],
    ["令和7年6月8日", "山陽新幹線さくら558号自由席特急券 広島->岡山"],
    ["令和7年6月8日", "特急スーパーいなば9号指定席特急券 岡山->鳥取"],
    # ================= 入場券 =================
    ["令和7年6月7日", "津山城跡鶴山公園"],
    ["令和7年6月7日", "福山城博物館"],
    ["令和7年6月8日", "宮島松大汽船 往復乗船券 宮島口<->宮島"],
    ["令和7年6月8日", "厳島神社"],
    ["令和7年6月8日", "千畳閣"],
    # ================= 食事 =================
    ["令和7年6月7日", "広島駅 かきめし 1/2"],
    ["令和7年6月7日", "広島駅 かきめし 2/2"],
    ["令和7年6月7日", "広島駅 もみじ饅頭 1/3"],
    ["令和7年6月7日", "広島駅 もみじ饅頭 2/3"],
    ["令和7年6月7日", "広島駅 もみじ饅頭 3/3"],
    ["令和7年6月8日", "呉駅 がんすうどん"],
    # ============================ 香川 ============================
    # ================= 乗車券 =================
    # ================= 特急券 =================
    # ================= 入場券 =================
    # ================= 食事 =================
    ["令和7年6月15日", "高松 うどん一福 かけうどん"],
    ["令和7年6月15日", "高松 ヨコクラうどん かけうどん"],
    ["令和7年6月15日", "高松 桃太郎館 ぶっかけうどん"],
    ["令和7年6月15日", "瀬戸PA きびだんご 1/3"],
    ["令和7年6月15日", "瀬戸PA きびだんご 2/3"],
    ["令和7年6月15日", "瀬戸PA きびだんご 3/3"],
    # ============================ 瀬戸内 ============================
    # ================= 乗車券 =================
    ["令和7年6月21日", "因美線・智頭急行・山陽本線・本四備讃線・予讃線・高徳線・鳴門線経由乗車券 鳥取->鳴門"],
    ["令和7年6月21日", "予讃線経由乗車券 宇多津->丸亀(往復(ゆき))"],
    ["令和7年6月21日", "予讃線経由乗車券 丸亀->宇多津(往復(かえり))"],
    ["令和7年6月22日", "神戸市営地下鉄西神山手線・神戸市営地下鉄北神線・神戸電鉄有馬線経由乗車券 三宮->有馬温泉"],
    ["令和7年6月22日", "神戸電鉄有馬線・神戸市営地下鉄北神線・神戸市営地下鉄西神山手線経由乗車券 有馬温泉->三宮"],
    ["令和7年6月22日", "東海道本線・山陽本線・智頭急行・因美線経由乗車券 三ノ宮->鳥取"],
    # ================= 特急券 =================
    ["令和7年6月21日", "特急スーパーいなば2号指定席特急券 鳥取->岡山"],
    ["令和7年6月21日", "特急しおかぜ5号自由席特急券 岡山->丸亀"],
    ["令和7年6月21日", "特急うずしお13号自由席特急券 高松->池谷"],
    ["令和7年6月22日", "特急スーパーはくと9号指定席特急券 明石->鳥取"],
    # ================= 入場券 =================
    ["令和7年6月21日", "丸亀城天守入場券"],
    ["令和7年6月21日", "高速観潮船 うずしお汽船 乗船券"],
    ["令和7年6月21日", "大鳴門橋遊歩道 渦の道 入場券"],
    ["令和7年6月21日", "まやビューライン 往復乗車券"],
    ["令和7年6月22日", "有馬温泉 金の湯・銀の湯"],
    # ================= 食事 =================
    ["令和7年6月21日", "高松駅 かけうどん"],
    # ============================ 島根・山口 ============================
    # ================= 乗車券 =================
    ["令和7年6月28日", "山陰本線・山口線・山陽新幹線・山陽本線・智頭急行・因美線経由乗車券 鳥取->鳥取"],
    ["令和7年6月29日", "山口線経由乗車券 新山口->山口(往復(ゆき))"],
    ["令和7年6月29日", "山口線経由乗車券 山口->新山口(往復(かえり))"],
    # ================= 特急券 =================
    ["令和7年6月28日", "特急スーパーまつかぜ1号自由席特急券 鳥取->浜田"],
    ["令和7年6月28日", "特急スーパーおき3号自由席特急券 浜田->津和野"],
    ["令和7年6月28日", "快速SLやまぐち号指定席券 津和野->新山口"],
    ["令和7年6月29日", "山陽新幹線こだま858号・さくら558号指定席特急券 新山口->岡山"],
    ["令和7年6月29日", "山陽新幹線こだま858号指定席特急券 新山口->徳山"],
    ["令和7年6月29日", "山陽新幹線さくら558号指定席特急券 徳山->岡山"],
    ["令和7年6月29日", "特急スーパーいなば9号指定席特急券 岡山->鳥取"],
    # ================= 入場券 =================
    ["令和7年6月28日", "津和野藩校養老館 入館券"],
    ["令和7年6月28日", "快速SLやまぐち号記念乗車券 1/2"],
    ["令和7年6月28日", "快速SLやまぐち号記念乗車券 2/2"],
    ["令和7年6月29日", "高速道路通行券 小郡IC->美祢東JCT"],
    ["令和7年6月29日", "駐車券 市営秋芳洞第1駐車場"],
    ["令和7年6月29日", "秋芳洞 観覧券"],
    ["令和7年6月29日", "高速道路通行券 美祢東JCT->小郡IC"],
    # ================= 食事 =================
    ["令和7年6月28日", "津和野駅 かしわめし弁当 1/2"],
    ["令和7年6月28日", "津和野駅 かしわめし弁当 2/2"],
    ["令和7年6月28日", "新山口駅 金光酒造 山頭火"],
    # ============================ 島根・鳥取 ============================
    # ================= 乗車券 =================
    ["令和7年7月5日", "山陰本線経由乗車券 鳥取->大田市(往復(ゆき))"],
    ["令和7年7月5日-令和7年7月6日", "山陰本線経由乗車券 大田市->鳥取(往復(かえり))"],
    ["令和7年7月5日", "一畑電車北松江線・大社線経由乗車券 電鉄出雲市->出雲大社前(往復(ゆき))"],
    ["令和7年7月5日", "一畑電車大社線・北松江線経由乗車券 出雲大社前->電鉄出雲市(往復(かえり))"],
    # ================= 特急券 =================
    ["令和7年7月5日", "特急スーパーまつかぜ1号自由席特急券 鳥取->大田市"],
    ["令和7年7月6日", "特急スーパーまつかぜ10号自由席特急券 倉吉->鳥取"],
    # ================= 入場券 =================
    ["令和7年7月5日", "石見銀山資料館 入館券"],
    ["令和7年7月5日", "石見銀山遺跡 龍源寺間歩 入場券"],
    ["令和7年7月6日", "松江城 登閣券"],
    # ================= 食事 =================
    ["令和7年7月5日", "出雲市駅 出雲手打ち割子そば"],
    ["令和7年7月5日", "出雲市駅 小さな山陰みやげ 豊の秋 辛口純米酒"],
    ["令和7年7月6日", "米子駅 山陰の味 大風呂敷 1/2"],
    ["令和7年7月6日", "米子駅 山陰の味 大風呂敷 2/2"],
    # ============================ 但馬 ============================
    # ================= 乗車券 =================
    ["令和7年7月12日", "山陰本線経由乗車券 鳥取->浜坂"],
    ["令和7年7月12日", "山陰本線経由乗車券 浜坂->城崎温泉"],
    ["令和7年7月12日", "山陰本線経由乗車券 城崎温泉->鳥取"],
    # ================= 特急券 =================
    # ================= 入場券 =================
    ["令和7年7月12日", "城崎温泉 1日入浴券"],
    ["令和7年7月12日", "城崎温泉ロープウェイ 山頂駅往復乗車券"],
    # ================= 食事 =================
    ["令和7年7月12日", "城崎温泉駅 城崎珈琲みはらしテラス 八鹿豚ホットドッグ"],
    ["令和7年7月12日", "城崎温泉駅 一の湯 白バラこだわりカフェオレ"],
    ["令和7年7月12日", "城崎温泉駅 かに寿し 1/2"],
    ["令和7年7月12日", "城崎温泉駅 かに寿し 2/2"],
    # ============================ 鳥取==>松本 ============================
    # ================= 乗車券 =================
    ["令和7年7月18日", "因美線・智頭急行・山陽本線・東海道本線・東海道新幹線・中央西線・篠ノ井線経由乗車券 鳥取->南松本"],
    # ================= 特急券 =================
    ["令和7年7月18日", "特急スーパーはくと8号指定席特急券 鳥取->大阪"],
    ["令和7年7月18日", "東海道新幹線のぞみ46号指定席特急券 新大阪->名古屋"],
    ["令和7年7月18日", "特急しなの25号指定席特急券 名古屋->塩尻"],
    # ================= 入場券 =================
    ["令和7年7月18日", "Osaka Metro・大阪シティバス1日乗車券"],
    # ================= 食事 =================
    ["令和7年7月18日", "大阪駅 道頓堀 たこ焼き"]
    ["令和7年7月18日", "鳥取駅 因幡の白兎 1/3"]
    ["令和7年7月18日", "鳥取駅 因幡の白兎 2/3"]
    ["令和7年7月18日", "鳥取駅 因幡の白兎 3/3"]
]

tottori_images = [
    "令和7年5月25日~令和7年7月18日 鳥取旅行",
    [
        # =================================================
        ["../trainCar/NoImage.jpg", "開発中"],
    ]
]

tottori_stations = [
    # ============================ 松本==>鳥取 ============================
    Minami_Matsumoto, Shiojiri, Nagoya, Shin_Osaka, Shin_Kobe, Himeji, Kamigori, Chizu, Tottori,
    # ============================ 鳥取 ============================
    Kurayoshi, Yonago, Sakaiminato, Yonago, Kurayoshi, Tottori,
    # ============================ 岡山・広島 ============================
    Chizu, Tsuyama, Okayama, Kurashiki, Fukuyama, Onomichi, Itozaki, Mihara, Higashi_Hiroshima, Hiroshima, Miyajima_Guchi, Hiroshima, Kure, Hiroshima, Higashi_Hiroshima, Mihara, Fukuyama, Okayama, Kamigori, Chizu, Tottori,
    # ============================ 瀬戸内 ============================
    Chizu, Kamigori, Okayama, Kojima, Utazu, Marugame, Utazu, Takamatsu, Ikenotani, Naruto, Otsuka_Museum_Of_Art, Maiko, Kobe, Sannomiya, Nada, Sannomiya, Kobe, Sannomiya, Shin_Kobe, Tanigami, Arima_Guchi, Arima_Onsen, Arima_Guchi, Tanigami, Shin_Kobe, Sannomiya, Kobe, Maiko, Akashi, Himeji, Kamigori, Chizu, Tottori,
    # ============================ 島根・山口 ============================
    Kurayoshi, Yonago, Matsue, Izumoshi, Odashi, Hamada, Tsuwano, Yamaguchi, Shin_Yamaguchi, Yamaguchi, Shin_Yamaguchi, Tokuyama, Hiroshima, Higashi_Hiroshima, Mihara, Fukuyama, Okayama, Kamigori, Chizu, Tottori,
    # ============================ 島根・鳥取 ============================
    Kurayoshi, Yonago, Matsue, Izumoshi, Odashi, Izumoshi, Dentetsu_Izumoshi, Kawato, Izumo_Taisha_Mae, Kawato, Dentetsu_Izumoshi, Izumoshi, Matsue, Yonago, Kurayoshi, Tottori,
    # ============================ 但馬 ============================
    Hamasaka, Kinosaki_Onsen, Hamasaka, Tottori,
    # ============================ 鳥取==>松本 ============================
    Chizu, Kamigori, Himeji, Akashi, Maiko, Kobe, Sannomiya, Nada, Osaka, Shin_Osaka, Nagoya, Shiojiri, Minami_Matsumoto,
]
