from .station_list import *

tottori = [
    # ============================ 松本==>鳥取 ============================
    # ================= 乗車券 =================
    ["令和7年5月25日", "篠ノ井線・中央西線・東海道山陽新幹線・山陽本線・智頭急行・因美線経由乗車券 南松本->鳥取"],
    # ================= 特急券 =================
    ["令和7年5月25日", "特急しなの8号指定席特急券 塩尻->名古屋"],
    ["令和7年5月25日", "東海道山陽新幹線のぞみ69号指定席特急券 名古屋->姫路"],
    ["令和7年5月25日", "特急スーパーはくと9号指定席特急券 姫路->鳥取"],
    # ================= 入場券 =================
    # ================= 食事 =================
    ["令和7年5月25日", "名古屋駅 名代きしめん 住よし きしめん"],
    ["令和7年5月25日", "鳥取駅 元祖かに寿し 1/2"],
    ["令和7年5月25日", "鳥取駅 元祖かに寿し 2/2"],
    # ============================ 鳥取 ============================
    # ================= 乗車券 =================
    ["令和7年6月1日", "山陰本線・境線経由乗車券 鳥取->境港(往復(ゆき))"],
    ["令和7年6月1日", "境線・山陰本線経由乗車券 境港->鳥取(往復(かえり))"],
    # ================= 特急券 =================
    ["令和7年6月1日", "特急スーパーまつかぜ3号自由席特急券 鳥取->米子"],
    ["令和7年6月1日", "特急スーパーおき4号自由席特急券 倉吉->鳥取"],
    # ================= 入場券 =================
    ["令和7年6月1日", "水木しげる記念館"],
    # ================= 食事 =================
    ["令和7年6月1日", "倉吉駅 鳥取二十世紀梨 ソフトキャンディ 1/2"],
    ["令和7年6月1日", "倉吉駅 鳥取二十世紀梨 ソフトキャンディ 2/2"],
    # ============================ 岡山・広島 ============================
    # ================= 乗車券 =================
    ["令和7年6月7日", "因美線・姫新線・津山線・山陽本線・山陽新幹線・山陽本線経由乗車券 鳥取->宮島口"],
    ["令和7年6月8日", "山陽本線・山陽新幹線・山陽本線・智頭急行・因美線経由乗車券 宮島口->鳥取"],
    ["令和7年6月8日", "山陽本線・呉線経由乗車券 広島->呉(往復(ゆき))"],
    ["令和7年6月8日", "呉線・山陽本線経由乗車券 呉->広島(往復(かえり))"],
    # ================= 特急券 =================
    ["令和7年6月7日", "山陽新幹線こだま859号自由席特急券 三原->広島"],
    ["令和7年6月8日", "山陽新幹線さくら558号自由席特急券 広島->岡山"],
    ["令和7年6月8日", "特急スーパーいなば9号指定席特急券 岡山->鳥取"],
    # ================= 入場券 =================
    ["令和7年6月7日", "津山城跡鶴山公園"],
    ["令和7年6月7日", "福山城博物館"],
    ["令和7年6月8日", "宮島松大汽船 往復乗船券 宮島口<->宮島"],
    ["令和7年6月8日", "厳島神社"],
    ["令和7年6月8日", "千畳閣"],
    # ================= 食事 =================
    ["令和7年6月7日", "広島駅 かきめし 1/2"],
    ["令和7年6月7日", "広島駅 かきめし 2/2"],
    ["令和7年6月7日", "広島駅 もみじ饅頭 1/3"],
    ["令和7年6月7日", "広島駅 もみじ饅頭 2/3"],
    ["令和7年6月7日", "広島駅 もみじ饅頭 3/3"],
    ["令和7年6月8日", "呉駅 がんすうどん"],
    # ============================ 香川 ============================
    # ================= 乗車券 =================
    # ================= 特急券 =================
    # ================= 入場券 =================
    # ================= 食事 =================
    ["令和7年6月15日", "高松 うどん一福 かけうどん"],
    ["令和7年6月15日", "高松 ヨコクラうどん かけうどん"],
    ["令和7年6月15日", "高松 桃太郎館 ぶっかけうどん"],
    ["令和7年6月15日", "瀬戸PA きびだんご 1/3"],
    ["令和7年6月15日", "瀬戸PA きびだんご 2/3"],
    ["令和7年6月15日", "瀬戸PA きびだんご 3/3"],
    # ============================ 瀬戸内 ============================
    # ================= 乗車券 =================
    ["令和7年6月21日", "因美線・智頭急行・山陽本線・本四備讃線・予讃線・高徳線・鳴門線経由乗車券 鳥取->鳴門"],
    ["令和7年6月21日", "予讃線経由乗車券 宇多津->丸亀(往復(ゆき))"],
    ["令和7年6月21日", "予讃線経由乗車券 丸亀->宇多津(往復(かえり))"],
    ["令和7年6月22日", "神戸市営地下鉄西神山手線・神戸市営地下鉄北神線・神戸電鉄有馬線経由乗車券 三宮->有馬温泉"],
    ["令和7年6月22日", "神戸電鉄有馬線・神戸市営地下鉄北神線・神戸市営地下鉄西神山手線経由乗車券 有馬温泉->三宮"],
    ["令和7年6月22日", "東海道本線・山陽本線・智頭急行・因美線経由乗車券 三ノ宮->鳥取"],
    # ================= 特急券 =================
    ["令和7年6月21日", "特急スーパーいなば2号指定席特急券 鳥取->岡山"],
    ["令和7年6月21日", "特急しおかぜ5号自由席特急券 岡山->丸亀"],
    ["令和7年6月21日", "特急うずしお13号自由席特急券 高松->池谷"],
    ["令和7年6月22日", "特急スーパーはくと9号指定席特急券 明石->鳥取"],
    # ================= 入場券 =================
    ["令和7年6月21日", "丸亀城天守入場券"],
    ["令和7年6月21日", "高速観潮船 うずしお汽船 乗船券"],
    ["令和7年6月21日", "大鳴門橋遊歩道 渦の道 入場券"],
    ["令和7年6月21日", "まやビューライン 往復乗車券"],
    ["令和7年6月22日", "有馬温泉 金の湯・銀の湯"],
    # ================= 食事 =================
    ["令和7年6月21日", "高松駅 かけうどん"],
]

tottori_images = [
    "令和7年5月25日~令和7年7月17日 鳥取旅行",
    [
        # =================================================
        ["../trainCar/NoImage.jpg", "開発中"],
    ]
]

tottori_stations = [Chiba, Tokyo, Chiba]
