takayama = [
    # ================= 切符 =================
    ["令和7年2月15日-令和7年2月17日", "総武本線・中央本線経由乗車券 千葉->大月"],
    ["令和7年2月8日", "中央本線・総武本線経由乗車券 大月->千葉"],
    ["令和7年2月8日", "特急成田エクスプレス2号指定席特急券 千葉->新宿"],
    ["令和7年2月8日", "特急かいじ11号指定席特急券 新宿->大月"],
    ["令和7年2月8日", "特急ふじやま14号自由席特急券 河口湖->大月"],
    ["令和7年2月8日", "特急かいじ40号指定席特急券 大月->新宿"],
    ["令和7年2月8日", "特急成田エクスプレス49号指定席特急券 新宿->千葉"],
    # ================= 入場券 =================
    # ================= 食事 =================
    ["令和7年2月8日", "富士山駅 吉田うどん"],
]
