from .station_list import *

tohoku_uetsu = [
    # ================= 乗車券 =================
    ["令和7年2月25日-令和7年2月26日", "旅せよ平日! JR東日本たびキュン早割パス(2日間用)"],
    # ================= 特急券 =================
    ["令和7年2月25日", "東北新幹線はやぶさ35号指定席特急券 仙台->新青森"],
    ["令和7年2月26日", "秋田新幹線こまち95号指定席特急券 盛岡->角館"],
    ["令和7年2月26日", "特急いなほ8号指定席特急券 秋田->酒田"],
    ["令和7年2月26日", "特急いなほ10号指定席特急券 酒田->新発田"],
    ["令和7年2月26日", "上越新幹線とき340号指定席特急券 新潟->東京"],
    # ================= 入場券 =================
    ["令和7年2月25日", "鶴ヶ城天守閣・茶室麟閣入場券"],
    ["令和7年2月26日", "河原田家観覧券"],
    ["令和7年2月26日", "重要伝統的建造物群保存地区(仙北市角館)"],
    ["令和7年2月26日", "本間家旧本邸"],
    # ================= 食事 =================
    ["令和7年2月25日", "郡山駅 きつねうどん"],
    ["令和7年2月25日", "新青森駅 青森りんご つがる"],
    ["令和7年2月26日", "新潟駅 そばミニタレカツ丼セット"],
]

tohoku_uetsu_images = [
    "令和7年2月25日~令和7年2月26日 東北一周旅行(東北・羽越)",
    [
        # =================================================
        ["12_千葉県/駅舎_千葉駅.jpg", "千葉駅 駅舎"],
        # --------------------------------------
        ["12_千葉県/駅名標_千葉駅_総武本線.jpg", "千葉駅 駅名標"],
        ["13_東京都/駅名標_東京駅_在来線_地下ホーム.jpg", "東京駅 駅名標(在来線)"],
        # --------------------------------------
        ["13_東京都/駅名標_東京駅_東北新幹線.jpg", "東京駅 駅名標(新幹線)"],
        ["07_福島県/駅名標_郡山駅_新幹線.jpg", "郡山駅 駅名標(新幹線)"],
        # --------------------------------------
        ["07_福島県/駅名標_郡山駅_在来線.jpg", "郡山駅 駅名標(在来線)"],
        ["07_福島県/駅名標_会津若松駅.jpg", "会津若松駅 駅名標"],
        # =================================================
        ["07_福島県/駅舎_会津若松駅.jpg", "会津若松駅 駅舎"],
        ["07_福島県/会津若松城.jpg", "会津若松城"],
        ["07_福島県/茶室麟閣.jpg", "茶室麟閣"],
        ["07_福島県/駅舎_七日町駅.jpg", "七日町駅 駅舎"],
        # --------------------------------------
        ["07_福島県/駅名標_七日町駅.jpg", "七日町駅 駅名標"],
        ["07_福島県/駅名標_会津若松駅.jpg", "会津若松駅 駅名標"],
        ["07_福島県/磐梯山.jpg", "磐梯山"],
        ["07_福島県/駅名標_郡山駅_在来線.jpg", "郡山駅 駅名標(在来線)"],
        # =================================================
        ["07_福島県/駅舎_郡山駅.jpg", "郡山駅 駅舎"],
        # --------------------------------------
        ["07_福島県/駅名標_郡山駅_新幹線.jpg", "郡山駅 駅名標(新幹線)"],
        ["07_福島県/駅名標_福島駅_新幹線.jpg", "福島駅 駅名標(新幹線)"],
        # =================================================
        ["07_福島県/駅舎_福島駅.jpg", "福島駅 駅舎"],
        # --------------------------------------
        ["07_福島県/駅名標_福島駅_新幹線.jpg", "福島駅 駅名標(新幹線)"],
        ["04_宮城県/駅名標_仙台駅_新幹線.jpg", "仙台駅 駅名標(新幹線)"],
        # =================================================
        ["04_宮城県/駅舎_仙台駅_昼.jpg", "仙台駅 駅舎"],
        ["04_宮城県/AER展望テラス.jpg", "AER展望テラス"],
        # --------------------------------------
        ["04_宮城県/駅名標_仙台駅_新幹線.jpg", "仙台駅 駅名標(新幹線)"],
        ["02_青森県/駅名標_新青森駅_新幹線.jpg", "新青森駅 駅名標(新幹線)"],
        # --------------------------------------
        ["02_青森県/駅名標_新青森駅_在来線.jpg", "新青森駅 駅名標(在来線)"],
        ["02_青森県/駅名標_青森駅.jpg", "青森駅 駅名標"],
        # =================================================
        ["02_青森県/駅舎_青森駅.jpg", "青森駅 駅舎"],
        ["02_青森県/青森駅_青森ベイブリッジ.jpg", "青森駅 青森ベイブリッジ"],
        # --------------------------------------
        ["02_青森県/駅名標_青森駅.jpg", "青森駅 駅名標"],
        ["02_青森県/駅名標_新青森駅_在来線.jpg", "新青森駅 駅名標(在来線)"],
        # =================================================
        ["02_青森県/駅舎_新青森駅.jpg", "新青森駅 駅舎"],
        ["02_青森県/りんご自販機.jpg", "新青森駅 りんご自販機"],
        # --------------------------------------
        ["02_青森県/駅名標_新青森駅_新幹線.jpg", "新青森駅 駅名標(新幹線)"],
        ["03_岩手県/駅名標_盛岡駅_東北新幹線.jpg", "盛岡駅 駅名標(新幹線)"],
        # =================================================
        ["03_岩手県/駅舎_盛岡駅.jpg", "盛岡駅 駅舎"],
        # --------------------------------------
        ["03_岩手県/駅名標_盛岡駅_秋田新幹線.jpg", "盛岡駅 駅名標(新幹線)"],
        ["05_秋田県/駅名標_角館駅.jpg", "角館駅 駅名標"],
        # =================================================
        ["05_秋田県/駅舎_角館駅.jpg", "角館駅 駅舎"],
        ["05_秋田県/角館武家屋敷通り.jpg", "角館武家屋敷通り"],
        ["05_秋田県/河原田家.jpg", "河原田家"],
        # --------------------------------------
        ["05_秋田県/駅名標_角館駅.jpg", "角館駅 駅名標"],
        ["05_秋田県/駅名標_秋田駅_新幹線.jpg", "秋田駅 駅名標(新幹線)"],
        # =================================================
        ["05_秋田県/駅舎_秋田駅.jpg", "秋田駅 駅舎"],
        # --------------------------------------
        ["05_秋田県/駅名標_秋田駅_在来線.jpg", "秋田駅 駅名標(在来線)"],
        ["06_山形県/駅名標_酒田駅.jpg", "酒田駅 駅名標"],
        # =================================================
        ["06_山形県/駅舎_酒田駅.jpg", "酒田駅 駅舎"],
        ["06_山形県/山居倉庫.jpg", "山居倉庫"],
        ["06_山形県/本間家旧本邸.jpg", "本間家旧本邸"],
        # --------------------------------------
        ["06_山形県/駅名標_酒田駅.jpg", "酒田駅 駅名標"],
        ["15_新潟県/笹川流れ.jpg", "笹川流れ"],
        ["15_新潟県/駅名標_新発田駅.jpg", "新発田駅 駅名標"],
        # =================================================
        ["15_新潟県/駅舎_新発田駅.jpg", "新発田駅 駅舎"],
        ["15_新潟県/新発田城.jpg", "新発田城"],
        # --------------------------------------
        ["15_新潟県/駅名標_新発田駅.jpg", "新発田駅 駅名標"],
        ["15_新潟県/駅名標_新潟駅_在来線.jpg", "新潟駅 駅名標(在来線)"],
        # =================================================
        ["15_新潟県/駅舎_新潟駅.jpg", "新潟駅 駅舎"],
        # --------------------------------------
        ["15_新潟県/駅名標_新潟駅_新幹線.jpg", "新潟駅 駅名標(新幹線)"],
        ["13_東京都/駅名標_東京駅_東北新幹線.jpg", "東京駅 駅名標(新幹線)"],
        # --------------------------------------
        ["13_東京都/駅名標_東京駅_在来線_地下ホーム.jpg", "東京駅 駅名標(在来線)"],
        ["12_千葉県/駅名標_千葉駅_総武本線.jpg", "千葉駅 駅名標"],
        # =================================================
        ["12_千葉県/駅舎_千葉駅.jpg", "千葉駅 駅舎"]
    ]
]

tohoku_uetsu_stations = [
    Chiba,       Tokyo,          Utsunomiya,  Koriyama,  Aizu_Wakamatsu,
    Nanukamachi, Aizu_Wakamatsu, Koriyama,    Fukushima, Shiroishi_Zao,
    Sendai,      Morioka,        Shin_Aomori, Aomori,    Shin_Aomori,
    Morioka,     Kakunodate,     Akita,       Sakata,    Shibata,
    Niigata,     Tokyo,          Chiba,
]
