tohoku_uetsu = [
    # ================= 切符 =================
    ["令和7年2月25日-令和7年2月26日", "旅せよ平日! JR東日本たびキュン早割パス(2日間用)"],
    ["令和7年2月25日", "東北新幹線はやぶさ35号指定席特急券 仙台->新青森"],
    ["令和7年2月26日", "秋田新幹線こまち95号指定席特急券 盛岡->角館"],
    ["令和7年2月26日", "特急いなほ8号指定席特急券 秋田->酒田"],
    ["令和7年2月26日", "特急いなほ10号指定席特急券 酒田->新発田"],
    ["令和7年2月26日", "上越新幹線とき340号指定席特急券 新潟->東京"],
    # ================= 入場券 =================
    ["令和7年2月25日", "鶴ヶ城天守閣・茶室麟閣入場券"],
    ["令和7年2月26日", "河原田家観覧券"],
    ["令和7年2月26日", "重要伝統的建造物群保存地区(仙北市角館)"],
    ["令和7年2月26日", "本間家旧本邸"],
    # ================= 食事 =================
    ["令和7年2月25日", "郡山駅 きつねうどん"],
    ["令和7年2月25日", "新青森駅 青森りんご つがる"],
    ["令和7年2月26日", "新潟駅 そばミニタレカツ丼セット"],
]

tohoku_uetsu_images = [
    "R7/2/25~R7/2/26 東北一周旅行(東北・羽越)",
    [
        # =================================================
        ["12_千葉県/駅舎_千葉駅.jpg", "千葉駅 駅舎"],
        # --------------------------------------
        ["12_千葉県/駅名標_千葉駅_総武本線.jpg", "千葉駅 駅名標"],
        ["../trainCar/12_千葉県/千葉駅_E217系.jpg", "総武快速線 千葉駅-->東京駅"],
        ["13_東京都/駅名標_東京駅_在来線_地下ホーム.jpg", "東京駅 駅名標(在来線)"],
        # --------------------------------------
        ["13_東京都/駅名標_東京駅_東北新幹線.jpg", "東京駅 駅名標(新幹線)"],
        ["../trainCar/13_東京都/東京駅_E5系.jpg", "東北新幹線 東京駅-->郡山駅"],
        ["07_福島県/駅名標_郡山駅_新幹線.jpg", "郡山駅 駅名標(新幹線)"],
        # --------------------------------------
        ["07_福島県/駅名標_郡山駅_在来線.jpg", "郡山駅 駅名標(在来線)"],
        ["../trainCar/07_福島県/郡山駅_E721系.jpg", "磐越西線 郡山駅-->会津若松駅"],
        ["07_福島県/駅名標_会津若松駅.jpg", "会津若松駅 駅名標"],
        # =================================================
        ["07_福島県/駅舎_会津若松駅.jpg", "会津若松駅 駅舎"],
        ["07_福島県/会津若松城.jpg", "会津若松城"],
        ["07_福島県/茶室麟閣.jpg", "茶室麟閣"],
        ["07_福島県/駅舎_七日町駅.jpg", "七日町駅 駅舎"],
        # --------------------------------------
        ["07_福島県/駅名標_七日町駅.jpg", "七日町駅 駅名標"],
        ["../trainCar/07_福島県/七日町駅_AT-550形.jpg",
         "会津鉄道 七日町駅-->会津若松駅"],
        ["07_福島県/駅名標_会津若松駅.jpg", "会津若松駅 駅名標"],
        ["../trainCar/07_福島県/会津若松駅_E721系.jpg", "磐越西線 会津若松駅-->郡山駅"],
        ["07_福島県/磐梯山.jpg", "磐梯山"],
        ["07_福島県/駅名標_郡山駅_在来線.jpg", "郡山駅 駅名標(在来線)"],
        # =================================================
        ["07_福島県/駅舎_郡山駅.jpg", "郡山駅 駅舎"],
        # --------------------------------------
        ["07_福島県/駅名標_郡山駅_新幹線.jpg", "郡山駅 駅名標(新幹線)"],
        ["../trainCar/07_福島県/郡山駅_E5系.jpg", "東北新幹線 郡山駅-->福島駅"],
        ["07_福島県/駅名標_福島駅_新幹線.jpg", "福島駅 駅名標(新幹線)"],
        # =================================================
        ["07_福島県/駅舎_福島駅.jpg", "福島駅 駅舎"],
        # --------------------------------------
        ["07_福島県/駅名標_福島駅_新幹線.jpg", "福島駅 駅名標(新幹線)"],
        ["../trainCar/04_宮城県/仙台駅_E5系.jpg", "東北新幹線 福島駅-->仙台駅"],
        ["04_宮城県/駅名標_仙台駅_新幹線.jpg", "仙台駅 駅名標(新幹線)"],
        # =================================================
        ["04_宮城県/駅舎_仙台駅_昼.jpg", "仙台駅 駅舎"],
        ["04_宮城県/AER展望テラス.jpg", "AER展望テラス"],
        # --------------------------------------
        ["04_宮城県/駅名標_仙台駅_新幹線.jpg", "仙台駅 駅名標(新幹線)"],
        ["../trainCar/04_宮城県/仙台駅_E5系.jpg", "東北新幹線 仙台駅-->新青森駅"],
        ["02_青森県/駅名標_新青森駅_新幹線.jpg", "新青森駅 駅名標(新幹線)"],
        # --------------------------------------
        ["02_青森県/駅名標_新青森駅_在来線.jpg", "新青森駅 駅名標(在来線)"],
        ["../trainCar/02_青森県/青森駅_E701系.jpg", "奥羽本線 新青森駅-->青森駅"],
        ["02_青森県/駅名標_青森駅.jpg", "青森駅 駅名標"],
        # =================================================
        ["02_青森県/駅舎_青森駅.jpg", "青森駅 駅舎"],
        ["02_青森県/青森駅_青森ベイブリッジ.jpg", "青森駅 青森ベイブリッジ"],
        # --------------------------------------
        ["02_青森県/駅名標_青森駅.jpg", "青森駅 駅名標"],
        ["../trainCar/02_青森県/青森駅_E701系.jpg", "奥羽本線 青森駅-->新青森駅"],
        ["02_青森県/駅名標_新青森駅_在来線.jpg", "新青森駅 駅名標(在来線)"],
        # =================================================
        ["02_青森県/駅舎_新青森駅.jpg", "新青森駅 駅舎"],
        ["02_青森県/りんご自販機.jpg", "新青森駅 りんご自販機"],
        # --------------------------------------
        ["02_青森県/駅名標_新青森駅_新幹線.jpg", "新青森駅 駅名標(新幹線)"],
        ["../trainCar/02_青森県/新青森駅_E5系.jpg", "東北新幹線 新青森駅-->盛岡駅"],
        ["03_岩手県/駅名標_盛岡駅_東北新幹線.jpg", "盛岡駅 駅名標(新幹線)"],
        # =================================================
        ["03_岩手県/駅舎_盛岡駅.jpg", "盛岡駅 駅舎"],
        # --------------------------------------
        ["03_岩手県/駅名標_盛岡駅_秋田新幹線.jpg", "盛岡駅 駅名標(新幹線)"],
        ["../trainCar/03_岩手県/盛岡駅_E6系.jpg", "東北新幹線 盛岡駅-->角館駅"],
        ["05_秋田県/駅名標_角館駅.jpg", "角館駅 駅名標"],
        # =================================================
        ["05_秋田県/駅舎_角館駅.jpg", "角館駅 駅舎"],
        ["05_秋田県/角館武家屋敷通り.jpg", "角館武家屋敷通り"],
        ["05_秋田県/河原田家.jpg", "河原田家"],
        # --------------------------------------
        ["05_秋田県/駅名標_角館駅.jpg", "角館駅 駅名標"],
        ["../trainCar/05_秋田県/角館駅_E6系.jpg", "秋田新幹線 角館駅-->秋田駅"],
        ["05_秋田県/駅名標_秋田駅_新幹線.jpg", "秋田駅 駅名標(新幹線)"],
        # =================================================
        ["05_秋田県/駅舎_秋田駅.jpg", "秋田駅 駅舎"],
        # --------------------------------------
        ["05_秋田県/駅名標_秋田駅_在来線.jpg", "秋田駅 駅名標(在来線)"],
        ["../trainCar/05_秋田県/秋田駅_E653系.jpg", "羽越本線 秋田駅-->酒田駅"],
        ["06_山形県/駅名標_酒田駅.jpg", "酒田駅 駅名標"],
        # =================================================
        ["06_山形県/駅舎_酒田駅.jpg", "酒田駅 駅舎"],
        ["06_山形県/山居倉庫.jpg", "山居倉庫"],
        ["06_山形県/本間家旧本邸.jpg", "本間家旧本邸"],
        # --------------------------------------
        ["06_山形県/駅名標_酒田駅.jpg", "酒田駅 駅名標"],
        ["../trainCar/06_山形県/酒田駅_E653系.jpg", "羽越本線 酒田駅-->新発田駅"],
        ["15_新潟県/笹川流れ.jpg", "笹川流れ"],
        ["15_新潟県/駅名標_新発田駅.jpg", "新発田駅 駅名標"],
        # =================================================
        ["15_新潟県/駅舎_新発田駅.jpg", "新発田駅 駅舎"],
        ["15_新潟県/新発田城.jpg", "新発田城"],
        # --------------------------------------
        ["15_新潟県/駅名標_新発田駅.jpg", "新発田駅 駅名標"],
        ["../trainCar/15_新潟県/新発田駅_E653系.jpg", "白新線 新発田駅-->新潟駅"],
        ["15_新潟県/駅名標_新潟駅_在来線.jpg", "新潟駅 駅名標(在来線)"],
        # =================================================
        ["15_新潟県/駅舎_新潟駅.jpg", "新潟駅 駅舎"],
        # --------------------------------------
        ["15_新潟県/駅名標_新潟駅_新幹線.jpg", "新潟駅 駅名標(新幹線)"],
        ["../trainCar/15_新潟県/新潟駅_E7系.jpg", "上越新幹線 新潟駅-->東京駅"],
        ["13_東京都/駅名標_東京駅_東北新幹線.jpg", "東京駅 駅名標(新幹線)"],
        # --------------------------------------
        ["13_東京都/駅名標_東京駅_在来線_地下ホーム.jpg", "東京駅 駅名標(在来線)"],
        ["../trainCar/13_東京都/東京駅_E217系.jpg", "総武快速線 東京駅-->千葉駅"],
        ["12_千葉県/駅名標_千葉駅_総武本線.jpg", "千葉駅 駅名標"],
        # =================================================
        ["12_千葉県/駅舎_千葉駅.jpg", "千葉駅 駅舎"]
    ]
]

tohoku_uetsu_stations = [
    [35.61978333333333, 140.11784444444444, "千葉駅"],
    [35.68104166666667, 139.76721388888888, "東京駅"],
    [37.39823611111111, 140.38832222222223, "郡山駅"],
    [37.50772222222222, 139.93066388888890, "会津若松駅"],
    [37.50153611111111, 139.91925000000000, "七日町駅"],
    [37.50772222222222, 139.93066388888890, "会津若松駅"],
    [37.39823611111111, 140.38832222222223, "郡山駅"],
    [37.75460555555556, 140.45999166666667, "福島駅"],
    [38.25924166666667, 140.88180555555556, "仙台駅"],
    [39.70152777777778, 141.13717777777777, "盛岡駅"],
    [40.82744166666667, 140.69268888888888, "新青森駅"],
    [40.82905277777778, 140.73306388888890, "青森駅"],
    [40.82744166666667, 140.69268888888888, "新青森駅"],
    [39.70152777777778, 141.13717777777777, "盛岡駅"],
    [39.59145277777777, 140.57130555555557, "角館駅"],
    [39.71662777777778, 140.12974444444444, "秋田駅"],
    [38.92191944444444, 139.84634444444444, "酒田駅"],
    [37.94379444444444, 139.33493055555556, "新発田駅"],
    [37.91206666666667, 139.06068333333334, "新潟駅"],
    [35.68104166666667, 139.76721388888888, "東京駅"],
    [35.61978333333333, 140.11784444444444, "千葉駅"],
]
