tohoku_uetsu = [
    # ================= 切符 =================
    ["令和7年2月25日-令和7年2月26日", "旅せよ平日! JR東日本たびキュン早割パス(2日間用)"],
    ["令和7年2月25日", "東北新幹線はやぶさ35号指定席特急券 仙台->新青森"],
    ["令和7年2月26日", "秋田新幹線こまち95号指定席特急券 盛岡->角館"],
    ["令和7年2月26日", "特急いなほ8号指定席特急券 秋田->酒田"],
    ["令和7年2月26日", "特急いなほ10号指定席特急券 酒田->新発田"],
    ["令和7年2月26日", "上越新幹線とき340号指定席特急券 新潟->東京"],
    # ================= 入場券 =================
    ["令和7年2月25日", "鶴ヶ城天守閣・茶室麟閣入場券"],
    ["令和7年2月26日", "河原田家観覧券"],
    ["令和7年2月26日", "重要伝統的建造物群保存地区(仙北市角館)"],
    ["令和7年2月26日", "本間家旧本邸"],
    # ================= 食事 =================
    ["令和7年2月25日", "郡山駅 きつねうどん"],
    ["令和7年2月25日", "新青森駅 青森りんご つがる"],
    ["令和7年2月26日", "新潟駅 そばミニタレカツ丼セット"],
]
