shikoku = [
    # ================= 切符 =================
    ["令和5年9月1日", "総武本線・東海道山陽新幹線・本四備讃線・予讃線経由乗車券 東千葉->高松"],
    ["令和5年9月1日", "東海道山陽新幹線のぞみ63号自由席特急券 東京->岡山"],
    ["令和5年9月2日-令和5年9月4日", "バースデイきっぷ 普通車自由席用"],
    ["令和5年9月2日", "高松琴平電気鉄道琴平線経由乗車券 高松築港->栗林公園"],
    ["令和5年9月2日", "高松琴平電気鉄道琴平線経由乗車券 栗林公園->高松築港"],
    ["令和5年9月3日", "伊予鉄道市内電車2Dayチケット"],
    ["令和5年9月5日", "南海フェリー 徳島港->和歌山港"],
    ["令和5年9月5日", "南海和歌山港線・南海本線経由乗車券 和歌山港->難波"],
    ["令和5年9月5日", "関西本線・大阪環状線・東海道本線・東海道新幹線・総武本線経由乗車券 JR難波->東千葉"],
    ["令和5年9月5日", "東海道新幹線のぞみ102号自由席特急券 新大阪->東京"],
    # ================= 入場券 =================
    ["令和5年9月1日", "岡山後楽園 岡山城天守閣 共通入場券"],
    ["令和5年9月2日", "玉藻公園(高松城) 入園券"],
    ["令和5年9月2日", "栗林公園 入園券"],
    ["令和5年9月2日", "今治城共通観覧券"],
    ["令和5年9月3日", "松山城入場券"],
    ["令和5年9月4日", "高知城入場券"],
    ["令和5年9月4日", "高知駅前三志士像ポストカード"],
    ["令和5年9月5日", "和歌山城入場券"],
    # ================= 食事 =================
]
