# 01_北海道
New_Chitose_Airport = [42.787686, 141.681869, "新千歳空港駅"]
Minami_Chitose      = [42.808225, 141.675231, "南千歳駅"]
Sapporo             = [43.068681, 141.350464, "札幌駅"]
Higashi_Muroran     = [42.348872, 141.025969, "東室蘭駅"]
Bokoi               = [42.316608, 140.988725, "母恋駅"]
Muroran             = [42.317981, 140.975328, "室蘭駅"]
Touya               = [42.550750, 140.763625, "洞爺駅"]
Hakodate            = [41.774761, 140.726228, "函館駅"]
Onuma_Koen          = [41.981450, 140.670394, "大沼公園駅"]
Oshamambe           = [42.512772, 140.374925, "長万部駅"]
Kutchan             = [42.902064, 140.745056, "倶知安駅"]
Otaru               = [43.197044, 140.993286, "小樽駅"]
Asahikawa           = [43.762475, 142.358733, "旭川駅"]
Naka_Furano         = [43.405614, 142.420914, "中富良野駅"]
Furano              = [43.346978, 142.391725, "富良野駅"]
Nayoro              = [44.349531, 142.465378, "名寄駅"]
Wakkanai            = [45.416711, 141.677322, "稚内駅"]
Engaru              = [44.059848, 143.520489, "遠軽駅"]
Kitami              = [43.804717, 143.896392, "北見駅"]
Abashiri            = [44.019967, 144.254150, "網走駅"]
Kushiro_Shitsugen   = [43.100614, 144.447800, "釧路湿原駅"]
Kushiro             = [42.990561, 144.382600, "釧路駅"]
Nemuro              = [43.326861, 145.582397, "根室駅"]
Higashi_Nemuro      = [43.323656, 145.597097, "東根室駅"]
Obihiro             = [42.917719, 143.202469, "帯広駅"]

# 02_青森県
Aomori      = [40.829206, 140.734147, "青森駅"]
Shin_Aomori = [40.828500, 140.694411, "新青森駅"]
Hachinohe   = [40.509486, 141.431367, "八戸駅"]
Hirosaki    = [40.599267, 140.485153, "弘前駅"]

# 03_岩手県
Ninohe     = [40.259372, 141.285661, "二戸駅"]
Morioka    = [39.701631, 141.136856, "盛岡駅"]
Kitakami   = [39.281503, 141.121414, "北上駅"]
Hiraizumi  = [38.988136, 141.117889, "平泉駅"]
Ichinoseki = [38.926481, 141.139075, "一ノ関駅"]

# 04_宮城県
Kogota        = [38.541583, 141.063264, "小牛田駅"]
Matsushima    = [38.379750, 141.065628, "松島駅"]
Sendai        = [38.260708, 140.881181, "仙台駅"]
Shiroishi_Zao = [37.994781, 140.632622, "白石蔵王駅"]

# 05_秋田県
Akita      = [39.717239, 140.128464, "秋田駅"]
Omagari    = [39.465786, 140.480072, "大曲駅"]
Yokote     = [39.309700, 140.560469, "横手駅"]
Kakunodate = [39.591453, 140.571306, "角館駅"]

# 06_山形県
Shinjyo  = [38.762311, 140.306106, "新庄駅"]
Yamagata = [38.247928, 140.327072, "山形駅"]
Akayu    = [38.047131, 140.149217, "赤湯駅"]
Miyauchi = [38.070744, 140.134981, "宮内駅"]
Yonezawa = [37.909606, 140.127931, "米沢駅"]
Sakata   = [38.921919, 139.846344, "酒田駅"]

# 07_福島県
Fukushima      = [37.754681, 140.458161, "福島駅"]
Nihonmatsu     = [37.589786, 140.434936, "二本松駅"]
Koriyama       = [37.398258, 140.387833, "郡山駅"]
Aizu_Wakamatsu = [37.508606, 139.930069, "会津若松駅"]
Nanukamachi    = [37.501536, 139.919250, "七日町駅"]
Shirakawa      = [37.129544, 140.212678, "白河駅"]
Shin_Shirakawa = [37.122861, 140.187994, "新白河駅"]

# 08_茨城県
Hitachi_Taga = [36.551528, 140.632003, "常陸多賀駅"]
Katsuta      = [36.394219, 140.524200, "勝田駅"]
Mito         = [36.370936, 140.476408, "水戸駅"]
Koga         = [36.194989, 139.709458, "古河駅"]

# 09_栃木県
Kuroiso    = [36.970317, 140.060347, "黒磯駅"]
Utsunomiya = [36.558742, 139.897981, "宇都宮駅"]
Nikko      = [36.747197, 139.622300, "日光駅"]

# 10_群馬県
Takasaki                = [36.323447, 139.012467, "高崎駅"]
Naganohara_Kusatsuguchi = [36.546211, 138.650208, "長野原草津口駅"]
Kusatsu_Onsen           = [36.620828, 138.596340, "草津温泉バスターミナル"]
Joshu_Tomioka           = [36.260508, 138.891525, "上州富岡駅"]

# 11_埼玉県
Kurihashi = [36.136852, 139.694177, "栗橋駅"]
Yagyu     = [36.206750, 139.659775, "柳生駅"]
Omiya     = [35.906175, 139.623458, "大宮駅"]
Miyahara  = [35.940072, 139.609572, "宮原駅"]
Kawagoe   = [35.906769, 139.483322, "川越駅"]
Asakadai  = [35.814481, 139.587294, "朝霞台駅"]
Wakoshi   = [35.788064, 139.613419, "和光市駅"]

# 12_千葉県
Nishi_Funabashi           = [35.707459, 139.959232, "西船橋駅"]
Funabashi                 = [35.701632, 139.985358, "船橋駅"]
Tsudanuma                 = [35.691831, 140.019836, "津田沼駅"]
Nishi_Chiba               = [35.622653, 140.103347, "西千葉駅"]
Chiba                     = [35.612408, 140.115708, "千葉駅"]
Higashi_Chiba             = [35.616931, 140.122300, "東千葉駅"]
Tsuga                     = [35.636458, 140.149672, "都賀駅"]
Sakura                    = [35.709739, 140.226719, "佐倉駅"]
Shisui                    = [35.731656, 140.275253, "酒々井駅"]
Narita                    = [35.777347, 140.313797, "成田駅"]
Narita_Airport_Terminal_1 = [35.767783, 140.384567, "成田空港駅"]
Narita_Airport_Terminal_2 = [35.773069, 140.387536, "空港第2ビル駅"]
Chishirodai               = [35.622411, 140.188339, "千城台駅"]
Chiba_Koen                = [35.619783, 140.117844, "千葉公園駅"]
Kenchoumae                = [35.603744, 140.122075, "県庁前駅"]
Chiba_Minato              = [35.607475, 140.102342, "千葉みなと駅"]
Kaihin_Makuhari           = [35.648556, 140.041662, "海浜幕張駅"]
Soga                      = [35.581512, 140.131144, "蘇我駅"]
Awa_Kamogawa              = [35.107606, 140.103286, "安房鴨川駅"]
Tateyama                  = [34.995644, 139.862014, "館山駅"]

# 13_東京都
Tokyo          = [35.681042, 139.767214, "東京駅"]
Ueno           = [35.713803, 139.777144, "上野駅"]
Ikebukuro      = [35.730085, 139.711095, "池袋駅"]
Shinjuku       = [35.691047, 139.700425, "新宿駅"]
Shibuya        = [35.658424, 139.701509, "渋谷駅"]
Shinagawa      = [35.629303, 139.740036, "品川駅"]
Shinbashi      = [35.667033, 139.757600, "新橋駅"]
Haneda_Airport = [35.549931, 139.786380, "羽田空港第1・第2ターミナル駅"]
Idabashi       = [35.701333, 139.744387, "飯田橋駅"]
Takaosanguchi  = [35.632394, 139.269797, "高尾山口駅"]

# 14_神奈川県
Yokohama    = [35.466195, 139.622704, "横浜駅"]
Sakuragicho = [35.450878, 139.631242, "桜木町駅"]
Ofuna       = [35.353466, 139.531127, "大船駅"]
Kamakura    = [35.317981, 139.550383, "鎌倉駅"]
Hase        = [35.311253, 139.535828, "長谷駅"]
Enoshima    = [35.311017, 139.487306, "湘南江の島駅・江ノ島駅"]
Fujisawa    = [35.338882, 139.487293, "藤沢駅"]
Odawara     = [35.256229, 139.155396, "小田原駅"]
Nebukawa    = [35.202717, 139.138492, "根府川駅"]

# 15_新潟県
Shibata     = [37.944120, 139.335189, "新発田駅"]
Niigata     = [37.912299, 139.060869, "新潟駅"]
Niitsu      = [37.800383, 139.121445, "新津駅"]
Nagaoka     = [37.447787, 138.853927, "長岡駅"]
Kashiwazaki = [37.363495, 138.556303, "柏崎駅"]
Naoetsu     = [37.170251, 138.242265, "直江津駅"]
Itoigawa    = [37.043631, 137.861311, "糸魚川駅"]
Oyashirazu  = [37.006818, 137.738104, "親不知駅"]

# 16_富山県
Tomari        = [36.951977, 137.555720, "泊駅"]
Toyama        = [36.701680, 137.212916, "富山駅"]
Takaoka       = [36.741523, 137.015088, "高岡駅"]
Marunouchi    = [36.692485, 137.208891, "丸の内駅"]
Sakurabashi   = [36.695038, 137.215938, "桜橋駅"]
Higashi_Iwase = [36.752457, 137.230762, "東岩瀬駅"]
Iwasehama     = [36.761497, 137.233955, "岩瀬浜駅"]

# 17_石川県
Kanazawa = [36.578334, 136.647834, "金沢駅"]

# 18_福井県
Fukui   = [36.062161, 136.222198, "福井駅"]
Tsuruga = [35.644857, 136.076294, "敦賀駅"]

# 19_山梨県
Otsuki        = [35.613196, 138.942730, "大月駅"]
Shimo_Yoshida = [35.497681, 138.803314, "下吉田駅"]
Fujisan       = [35.483495, 138.795759, "富士山駅"]
Kawaguchiko   = [35.498207, 138.768629, "河口湖駅"]
Kofu          = [35.667170, 138.568979, "甲府駅"]

# 20_長野県
Gondo            = [36.653264, 138.191946, "権堂駅"]
Nagano           = [36.643009, 138.188673, "長野駅"]
Obasute          = [36.502568, 138.093304, "姨捨駅"]
Matsumoto        = [36.230855, 137.964325, "松本駅"]
Minami_Matsumoto = [36.209715, 137.968941, "南松本駅"]
Hirata           = [36.191562, 137.962512, "平田駅"]
Hirooka          = [36.148256, 137.949566, "広丘駅"]
Shiojiri         = [36.114328, 137.947801, "塩尻駅"]
Kamisuwa         = [36.046683, 138.116482, "上諏訪駅"]
Narai            = [35.969047, 137.815473, "奈良井駅"]
Agematsu         = [35.784019, 137.693453, "上松駅"]
Nagiso           = [35.598771, 137.608361, "南木曽駅"]

# 21_岐阜県
Nakatsugawa   = [35.500472, 137.503119, "中津川駅"]
Tajimi        = [35.335003, 137.120893, "多治見駅"]
Gifu          = [35.409532, 136.756514, "岐阜駅"]
Ogaki         = [35.367096, 136.618288, "大垣駅"]
Gero          = [35.805345, 137.239778, "下呂駅"]
Takayama      = [36.140574, 137.251301, "高山駅"]
Hida_Furukawa = [36.236727, 137.189681, "飛騨古川駅"]
Shirakawago   = [36.261988, 136.906768, "白川郷バスターミナル"]

# 22_静岡県
Atami      = [35.103573, 139.077679, "熱海駅"]
Mishima    = [35.126253, 138.911133, "三島駅"]
Numazu     = [35.103011, 138.860104, "沼津駅"]
Fuji       = [35.151481, 138.651201, "富士駅"]
Shimizu    = [35.023248, 138.488958, "清水駅"]
Shizuoka   = [34.971629, 138.388579, "静岡駅"]
Kakegawa   = [34.76925, 138.014893, "掛川駅"]
Hamamatsu  = [34.703819, 137.734701, "浜松駅"]
Bentenjima = [34.690125, 137.603058, "弁天島駅"]

# 23_愛知県
Toyohashi          = [34.762734, 137.382128, "豊橋駅"]
Toyokawa           = [34.822453, 137.397092, "豊川駅"]
Okazaki            = [34.925536, 137.157274, "岡崎駅"]
Naka_Okazaki       = [34.955804, 137.152627, "中岡崎駅"]
Kanayama           = [35.142928, 136.900517, "金山駅"]
Nagoya             = [35.170694, 136.881637, "名古屋駅"]
Kiyosu             = [35.224607, 136.835495, "清洲駅"]
Owari_Ichinomiya   = [35.302295, 136.797245, "尾張一宮駅"]
Nagoya_Castle      = [35.181560, 136.905379, "名古屋城駅"]
Hisaya_Odori       = [35.173738, 136.908107, "久屋大通駅"]
Sakae              = [35.169990, 136.908031, "栄駅"]
Hibino             = [35.132436, 136.892970, "日比野駅"]
Atsuta_Jingu_Nishi = [35.127956, 136.906769, "熱田神宮西駅"]
Kamimaezu          = [35.157477, 136.906815, "上前津駅"]
Osu_Kannon         = [35.160729, 136.898158, "大須観音駅"]
Fushimi            = [35.169273, 136.897427, "伏見駅"]
Motoyama           = [ 35.163964,136.963239, "本山駅"]
Nagoya_University  = [35.154261, 136.966580, "名古屋大学駅"]
Jingumae           = [35.125805, 136.912331, "神宮前駅"]
Meitetsu_Nagoya    = [35.169789, 136.883819, "名鉄名古屋駅"]
Inuyama_Yuen       = [35.390791, 136.946902, "犬山遊園駅"]

# 24_三重県
Iseshi    = [34.491260, 136.709661, "伊勢市駅"]
Ujiyamada = [34.488256, 136.714002, "宇治山田駅"]

# 25_滋賀県
Omi_Shiotsu     = [35.538530, 136.151672, "近江塩津駅"]
Nagahama        = [35.378451, 136.265161, "長浜駅"]
Maibara         = [35.314721, 136.289839, "米原駅"]
Hikone          = [35.272205, 136.263344, "彦根駅"]
Kusatsu         = [35.022359, 135.961723, "草津駅"]
Minami_Kusatsu  = [35.003746, 135.947251, "南草津駅"]
Otsu            = [35.003336, 135.864552, "大津駅"]
Otani           = [34.994160, 135.853505, "大谷駅"]
Biwako_Hamaotsu = [35.011315, 135.863873, "びわ湖浜大津駅"]
Miidera         = [35.013018, 135.859560, "三井寺駅"]

# 26_京都府
Yamashina         = [34.991533, 135.818791, "山科駅"]
Kyoto             = [34.985465, 135.757748, "京都駅"]
MukoMachi         = [34.954838, 135.709804, "向日町駅"]
Inari             = [34.966758, 135.770707, "稲荷駅"]
Uji               = [34.890437, 135.800629, "宇治駅"]
Saga_Arashiyama   = [35.018698, 135.68127, "嵯峨嵐山駅"]
Kameoka           = [35.016738, 135.582766, "亀岡駅"]
Fukuchiyama       = [35.296143, 135.118564, "福知山駅"]
Miyazu            = [35.534289, 135.199576, "宮津駅"]
Amanohashidate    = [35.557729, 135.182456, "天橋立駅"]
Fushimi_Inari     = [34.968966, 135.769279, "伏見稲荷駅"]
Shimizu_Gojyo     = [34.995691, 135.768378, "清水五条駅"]
Higashiyama       = [35.009425, 135.780448, "東山駅"]
Nijyo_Castle      = [35.011892, 135.750473, "二条城前駅"]
Tenjingawa        = [35.010816, 135.716085, "太秦天神川駅・嵐電天神川駅"]
Arashiyama        = [35.015271, 135.677698, "嵐山駅"]
Katabiranotsuji   = [35.015146, 135.700257, "帷子ノ辻󠄀駅"]
Kitano_Hakubaicho = [35.027409, 135.730846, "北野白梅町駅"]
Shijo_Omiya       = [35.003190, 135.748395, "四条大宮駅・大宮駅"]
Karasuma          = [35.003665, 135.759108, "烏丸駅・四条駅"]

# 27_大阪府
Shin_Osaka        = [34.734136, 135.501852, "新大阪駅"]
Osaka             = [34.702398, 135.495188, "大阪駅"]
Umeda             = [34.703765, 135.497496, "梅田駅"]
Shinsaibashi      = [34.675012, 135.500330, "心斎橋駅"]
JR_Namba          = [34.666438, 135.495265, "JR難波駅"]
Namba             = [34.666316, 135.500277, "なんば駅"]
Nankai_Namba      = [34.66357, 135.501949, "南海なんば駅"]
Imamiya           = [34.654156, 135.492975, "今宮駅"]
Dobutsuen_Mae     = [34.648815, 135.504413, "動物園前駅"]
Tennoji           = [34.647243, 135.514124, "天王寺駅"]
Tanimachi_4_Chome = [34.681914, 135.517253, "谷町四丁目駅"]
Temmabashi        = [34.690200, 135.516633, "天満橋駅"]
Higashi_Umeda     = [34.701031, 135.499690, "東梅田駅"]

# 28_兵庫県
Shin_Kobe               = [34.706417, 135.195758, "新神戸駅"]
Nada                    = [34.705918, 135.216578, "灘駅"]
Sannomiya               = [34.694766, 135.195058, "三ノ宮駅"]
Kyukyoryuchi_Daimarumae = [34.689369, 135.189836, "旧居留地・大丸前駅"]
Minato_Motomachi        = [34.685875, 135.183973, "みなと元町駅"]
Harborland              = [34.678554, 135.178657, "ハーバーランド駅"]
Tanigami                = [34.761691, 135.171420, "谷上駅"]
Arima_Guchi             = [34.796477, 135.221018, "有馬口駅"]
Arima_Onsen             = [34.799385, 135.245868, "有馬温泉駅"]
Kobe                    = [34.679453, 135.178221, "神戸駅"]
Maiko                   = [34.633020, 135.034373, "舞子駅"]
Akashi                  = [34.649084, 134.992512, "明石駅"]
Himeji                  = [34.827659, 134.690769, "姫路駅"]
Aioi                    = [34.818052, 134.473410, "相生駅"]
Kamigori                = [34.865845, 134.354081, "上郡駅"]
Kinosaki_Onsen          = [35.623764, 134.813437, "城崎温泉駅"]
Amarube                 = [35.648658, 134.556918, "餘部駅"]
Hamasaka                = [35.620618, 134.452558, "浜坂駅"]

# 29_奈良県
Nara            = [34.680924, 135.818991, "奈良駅"]
Kintetsu_Nara   = [34.684281, 135.827764, "近鉄奈良駅"]
Shin_Omiya      = [34.685381, 135.811375, "新大宮駅"]
Yamato_Saidaiji = [34.693736, 135.782791, "大和西大寺駅"]

# 30_和歌山県
Wakayamakou = [34.216906, 135.145767, "和歌山港駅"]
Wakayamashi = [34.236443, 135.166714, "和歌山市駅"]

# 31_鳥取県
Tottori     = [35.493953, 134.225901, "鳥取駅"]
Kurayoshi   = [35.454730, 133.849661, "倉吉駅"]
Yonago      = [35.423270, 133.336570, "米子駅"]
Sakaiminato = [35.545002, 133.222762, "境港駅"]
Chizu       = [35.264992, 134.225590, "智頭駅"]
Tsunoi      = [35.461129, 134.248594, "津ノ井駅"]

# 32_島根県
Matsue            = [35.463947, 133.063871, "松江駅"]
Izumoshi          = [35.360694, 132.756518, "出雲市駅"]
Dentetsu_Izumoshi = [35.361130, 132.757770, "電鉄出雲市駅"]
Kawato            = [35.395127, 132.776411, "川跡駅"]
Izumo_Taisha_Mae  = [35.393245, 132.687531, "出雲大社前駅"]
Odashi            = [35.200864, 132.499343, "大田市駅"]
Hamada            = [34.902683, 132.088588, "浜田駅"]
Tsuwano           = [34.472529, 131.773727, "津和野駅"]

# 33_岡山県
Tsuyama         = [35.054511, 134.003477, "津山駅"]
Okayama         = [34.666572, 133.918552, "岡山駅"]
Okayama_Eki_Mae = [34.665458, 133.920100, "岡山駅前駅"]
Shiroshita      = [34.665599, 133.929756, "城下駅"]
Kurashiki       = [34.601567, 133.765473, "倉敷駅"]
Kojima          = [34.462817, 133.807729, "児島駅"]

# 34_広島県
Fukuyama          = [34.489291, 133.361429, "福山駅"]
Onomichi          = [34.404826, 133.192884, "尾道駅"]
Itozaki           = [34.392429, 133.104317, "糸崎駅"]
Mihara            = [34.400486, 133.083049, "三原駅"]
Higashi_Hiroshima = [34.389273, 132.759646, "東広島駅"]
Kure              = [34.244652, 132.557578, "呉駅"]
Hiroshima         = [34.397446, 132.475593, "広島駅"]
Hiroden_Hiroshima = [34.396296, 132.475403, "広電広島駅"]
Miyajima_Guchi    = [34.312081, 132.302689, "宮島口駅"]

# 35_山口県
Iwakuni        = [34.171828, 132.225631, "岩国駅"]
Tokuyama       = [34.051555, 131.802900, "徳山駅"]
Shin_Yamaguchi = [34.093255, 131.396570, "新山口駅"]
Yamaguchi      = [34.172737, 131.480985, "山口駅"]
Shimonoseki    = [33.950306, 130.923038, "下関駅"]

# 36_徳島県
Ikenotani            = [34.153039, 134.528672, "池谷駅"]
Naruto               = [34.179056, 134.608489, "鳴門駅"]
Tokushima            = [34.074569, 134.551483, "徳島駅"]
Tokushima_Port       = [34.056382, 134.584175, "徳島港"]
Otsuka_Museum_Of_Art = [34.231532, 134.636498, "大塚国際美術館前バス停"]
Oboke                = [33.876419, 133.767364, "大歩危駅"]

# 37_香川県
Takamatsu        = [34.350586, 134.045533, "高松駅"]
Takamatsu_Chikko = [34.350914, 134.049225, "高松築港駅"]
Ritsurin_Koen    = [34.328678, 134.051147, "栗林公園駅"]
Utazu            = [34.306239, 133.813697, "宇多津駅"]
Marugame         = [34.292161, 133.793136, "丸亀駅"]
Tadotsu          = [34.271478, 133.757172, "多度津駅"]
Kotohira         = [34.192453, 133.821000, "琴平駅"]

# 38_愛媛県
Imabari           = [34.064056, 132.993272, "今治駅"]
Matsuyama         = [33.840917, 132.751083, "松山駅"]
Matsuyama_Eki_Mae = [33.840550, 132.752472, "松山駅前駅"]
Matsuyamashi      = [33.836194, 132.762694, "松山市駅"]
Okaido            = [33.841182, 132.770220, "大街道駅"]
Katsuyamacho      = [33.841750, 132.774933, "勝山町駅"]
Dougo_Onsen       = [33.850536, 132.785203, "道後温泉駅"]

# 39_高知県
Kochi         = [33.567019, 133.543700, "高知駅"]
Kochi_Eki_Mae = [33.566964, 133.543731, "高知駅前駅"]
Harimayabashi = [33.559497, 133.542855, "はりまや橋駅"]
Kochi_Castle  = [33.558586, 133.534425, "高知城前駅"]

# 40_福岡県
Mojikou                = [33.944131, 130.960603, "門司港駅"]
Moji                   = [33.904114, 130.932397, "門司駅"]
Kokura                 = [33.885639, 130.881836, "小倉駅"]
Hakata                 = [33.590133, 130.420692, "博多駅"]
Kurume                 = [33.320184, 130.501331, "久留米駅"]
Ginsui                 = [33.054906, 130.460889, "銀水駅"]
Fukuoka_Airport        = [33.597008, 130.448136, "福岡空港駅"]
Nakasu_Kawabata        = [33.594394, 130.406019, "中洲川端駅"]
Tenjin                 = [33.591341, 130.398899, "天神駅"]
Ohori_Koen             = [33.590065, 130.378857, "大濠公園駅"]
Nishitetsu_Fukuoka     = [33.589078, 130.399597, "西鉄福岡（天神）駅"]
Tofuro_Mae             = [33.511964, 130.507594, "都府楼前駅"]
Nishitetsu_Futsukaichi = [33.502226, 130.517879, "西鉄二日市駅"]
Dazaifu                = [33.518342, 130.531158, "太宰府駅"]

# 41_佐賀県
Tosu             = [33.374344, 130.519911, "鳥栖駅"]
Shin_Tosu        = [33.370017, 130.491347, "新鳥栖駅"]
Yoshinogari_Koen = [33.324733, 130.399003, "吉野ヶ里公園駅"]
Saga             = [33.264244, 130.297333, "佐賀駅"]
Takeo_Onsen      = [33.195981, 130.023117, "武雄温泉駅"]

# 42_長崎県
Nagasaki          = [32.752981, 129.869736, "長崎駅"]
Isahaya           = [32.851497, 130.041306, "諫早駅"]
Haiki             = [33.133939, 129.799561, "早岐駅"]
Sasebo            = [33.164033, 129.726731, "佐世保駅"]
Oura_Cathedral    = [32.736314, 129.870833, "大浦天主堂駅"]
Shinchi_Chinatown = [32.742933, 129.875050, "新地中華街駅"]
Dejima            = [32.743949, 129.871706, "出島駅"]
Gotomachi         = [32.749139, 129.872392, "五島町駅"]
Nagasaki_Eki_Mae  = [32.752808, 129.871764, "長崎駅前駅"]
Heiwa_Koen        = [32.774036, 129.862032, "平和公園駅"]

# 43_熊本県
Kumamoto        = [32.789425, 130.688469, "熊本駅"]
Kumamoto_Castle = [32.803169, 130.707222, "熊本城・市役所前駅"]
Yatsushiro      = [32.503832, 130.621483, "八代駅"]

# 44_大分県
Beppu = [33.279769, 131.500825, "別府駅"]
Oita  = [33.232861, 131.606628, "大分駅"]
Usuki = [33.118786, 131.807206, "臼杵駅"]

# 45_宮崎県
Nobeoka          = [32.590789, 131.672653, "延岡駅"]
Sadowara         = [32.022408, 131.477036, "佐土原駅"]
Miyazaki_Jingu   = [31.938575, 131.430681, "宮崎神宮駅"]
Miyazaki         = [31.916072, 131.431733, "宮崎駅"]
Tayoshi          = [31.879186, 131.430322, "田吉駅"]
Aoshima          = [31.799900, 131.466933, "青島駅"]
Miyazaki_Airport = [31.872592, 131.439636, "宮崎空港駅"]

# 46_鹿児島県
Satsuma_Taki      = [31.892800, 130.220814, "薩摩高城駅"]
Satsuma_Sendai    = [31.813772, 130.312461, "川内駅"]
Kagoshima_Chuo    = [31.583753, 130.541803, "鹿児島中央駅"]
Kagoshima         = [31.602178, 130.564142, "鹿児島駅"]
Kagoshima_Port    = [31.596560, 130.562882, "鹿児島港"]
Sakurajima_Port   = [31.592239, 130.599950, "桜島港"]
Kagoshima_Airport = [31.800856, 130.716219, "鹿児島空港"]

# 47_沖縄県
Naha_Airport        = [26.206586, 127.652334, "那覇空港駅"]
Akamine             = [26.193346, 127.660429, "赤嶺駅"]
Prefectural_Office  = [26.214484, 127.679293, "県庁前駅"]
Miebashi            = [26.219379, 127.684342, "美栄橋駅"]
Makishi             = [26.217366, 127.692467, "牧志駅"]
Gibo                = [26.224683, 127.719011, "儀保駅"]
Shuri               = [26.219264, 127.725448, "首里駅"]
Urasoe_Maeda        = [26.243952, 127.732208, "浦添前田駅"]
Tedako_Uranishi     = [26.241842, 127.741849, "てだこ浦西駅"]
Manzamo             = [26.505042, 127.849959, "万座毛"]
Nago_Pineapple_Park = [26.616532, 127.969512, "ナゴパイナップルパーク"]
Okashi_Goten        = [26.637259, 127.959612, "御菓子御殿 名護店"]
Kouri               = [26.695000, 128.021196, "古宇利島"]
Churaumi_Aquarium   = [26.694546, 127.877999, "美ら海水族館"]
