# 01_北海道
New_Chitose_Airport = [42.787651, 141.681057, "新千歳空港駅"]
Minami_Chitose      = [42.808398, 141.675327, "南千歳駅"]
Sapporo             = [43.068567, 141.350710, "札幌駅"]
Higashi_Muroran     = [42.348739, 141.025344, "東室蘭駅"]
Bokoi               = [42.317166, 140.989379, "母恋駅"]
Muroran             = [42.317977, 140.974389, "室蘭駅"]
Touya               = [42.550544, 140.763564, "洞爺駅"]
Hakodate            = [41.773745, 140.726361, "函館駅"]
Onuma_Koen          = [41.981111, 140.670016, "大沼公園駅"]
Oshamambe           = [42.513106, 140.375784, "長万部駅"]
Kutchan             = [42.901688, 140.745754, "倶知安駅"]
Otaru               = [43.197648, 140.993656, "小樽駅"]
Asahikawa           = [43.762760, 142.358301, "旭川駅"]
Naka_Furano         = [43.405745, 142.421156, "中富良野駅"]
Furano              = [43.346756, 142.391273, "富良野駅"]
Nayoro              = [44.349414, 142.465149, "名寄駅"]
Wakkanai            = [45.417033, 141.677149, "稚内駅"]
Engaru              = [44.059848, 143.520489, "遠軽駅"]
Kitami              = [43.804898, 143.897220, "北見駅"]
Abashiri            = [44.020026, 144.253973, "網走駅"]
Kushiro_Shitsugen   = [43.100575, 144.447810, "釧路湿原駅"]
Kushiro             = [42.990305, 144.382354, "釧路駅"]
Nemuro              = [43.326891, 145.582661, "根室駅"]
Higashi_Nemuro      = [43.323667, 145.597220, "東根室駅"]
Obihiro             = [42.917977, 143.202032, "帯広駅"]

# 02_青森県
Aomori      = [40.828668, 140.734738, "青森駅"]
Shin_Aomori = [40.827500, 140.693472, "新青森駅"]
Hachinohe   = [40.509200, 141.431499, "八戸駅"]
Hirosaki    = [40.599723, 140.485016, "弘前駅"]

# 03_岩手県
Ninohe     = [40.259970, 141.286211, "二戸駅"]
Morioka    = [39.701547, 141.136599, "盛岡駅"]
Kitakami   = [39.281196, 141.121221, "北上駅"]
Hiraizumi  = [38.987935, 141.117786, "平泉駅"]
Ichinoseki = [38.926514, 141.138177, "一ノ関駅"]

# 04_宮城県
Kogota        = [38.541111, 141.064355, "小牛田駅"]
Matsushima    = [38.379892, 141.065982, "松島駅"]
Sendai        = [38.260027, 140.882158, "仙台駅"]
Shiroishi_Zao = [37.995192, 140.632960, "白石蔵王駅"]

# 05_秋田県
Akita      = [39.716748, 140.129931, "秋田駅"]
Omagari    = [39.465712, 140.479628, "大曲駅"]
Yokote     = [39.310146, 140.560400, "横手駅"]
Kakunodate = [39.591716, 140.570988, "角館駅"]

# 06_山形県
Shinjyo  = [38.762560, 140.306064, "新庄駅"]
Yamagata = [38.248098, 140.327253, "山形駅"]
Akayu    = [38.047081, 140.148978, "赤湯駅"]
Miyauchi = [38.070849, 140.135293, "宮内駅"]
Yonezawa = [37.909478, 140.128209, "米沢駅"]
Sakata   = [38.922194, 139.845987, "酒田駅"]

# 07_福島県
Fukushima      = [37.754123, 140.459680, "福島駅"]
Nihonmatsu     = [37.589598, 140.435389, "二本松駅"]
Koriyama       = [37.398187, 140.389363, "郡山駅"]
Aizu_Wakamatsu = [37.508824, 139.930159, "会津若松駅"]
Nanukamachi    = [37.501210, 139.918958, "七日町駅"]
Shirakawa      = [37.129692, 140.213742, "白河駅"]
Shin_Shirakawa = [37.123310, 140.188969, "新白河駅"]

# 08_茨城県
Hitachi_Taga = [36.552102, 140.632360, "常陸多賀駅"]
Katsuta      = [36.394540, 140.524349, "勝田駅"]
Mito         = [36.370819, 140.476199, "水戸駅"]
Koga         = [36.194722, 139.709572, "古河駅"]

# 09_栃木県
Kuroiso    = [36.969893, 140.059837, "黒磯駅"]
Utsunomiya = [36.559056, 139.898357, "宇都宮駅"]
Nikko      = [36.747265, 139.622011, "日光駅"]

# 10_群馬県
Takasaki                = [36.322466, 139.012631, "高崎駅"]
Naganohara_Kusatsuguchi = [36.546704, 138.648063, "長野原草津口駅"]
Kusatsu                 = [36.620828, 138.596340, "草津温泉バスターミナル"]
Joshu_Tomioka           = [36.260367, 138.892104, "上州富岡駅"]

# 11_埼玉県
Kurihashi = [36.136805, 139.694221, "栗橋駅"]
Yagyu     = [36.206651, 139.659569, "柳生駅"]
Omiya     = [35.906917, 139.622806, "大宮駅"]
Miyahara  = [35.940198, 139.609503, "宮原駅"]
Kawagoe   = [35.907122, 139.482913, "川越駅"]
Wakoshi   = [35.788499, 139.612381, "和光市駅"]

# 12_千葉県
Funabashi                 = [35.701632, 139.985358, "船橋駅"]
Tsudanuma                 = [35.691266, 140.020374, "津田沼駅"]
Nishi_Chiba               = [35.622316, 140.103574, "西千葉駅"]
Chiba                     = [35.613250, 140.113361, "千葉駅"]
Higashi_Chiba             = [35.616813, 140.122102, "東千葉駅"]
Tsuga                     = [35.636086, 140.149269, "都賀駅"]
Sakura                    = [35.709702, 140.226068, "佐倉駅"]
Shisui                    = [35.731779, 140.275305, "酒々井駅"]
Narita                    = [35.777832, 140.314086, "成田駅"]
Narita_Airport_Terminal_1 = [35.764985, 140.385726, "成田空港駅"]
Narita_Airport_Terminal_2 = [35.773215, 140.387091, "空港第2ビル駅"]
Awa_Kamogawa              = [35.107611, 140.103823, "安房鴨川駅"]
Tateyama                  = [34.995790, 139.862085, "館山駅"]

# 13_東京都
Tokyo          = [35.681041, 139.767106, "東京駅"]
Ueno           = [35.713365, 139.776703, "上野駅"]
Ikebukuro      = [35.730085, 139.711095, "池袋駅"]
Shinjuku       = [35.689579, 139.700676, "新宿駅"]
Shibuya        = [35.658424, 139.701509, "渋谷駅"]
Shinagawa      = [35.628431, 139.739030, "品川駅"]
Shinbashi      = [35.666536, 139.758177, "新橋駅"]
Naneda_Airport = [35.549931, 139.786380, "羽田空港第1・第2ターミナル駅"]

# 14_神奈川県
Yokohama    = [35.466195, 139.622704, "横浜駅"]
Sakuragicho = [35.451112, 139.630881, "桜木町駅"]
Ofuna       = [35.353466, 139.531127, "大船駅"]
Kamakura    = [35.318793, 139.550428, "鎌倉駅"]
Hase        = [35.311265, 139.536168, "長谷駅"]
Enoshima    = [35.311867, 139.487794, "湘南江の島駅・江ノ島駅"]
Fujisawa    = [35.338882, 139.487293, "藤沢駅"]
Odawara     = [35.256229, 139.155396, "小田原駅"]
Nebukawa    = [35.202455, 139.138504, "根府川駅"]

# 15_新潟県
Shibata     = [37.944012, 139.334803, "新発田駅"]
Niigata     = [37.912135, 139.061371, "新潟駅"]
Niitsu      = [37.799922, 139.121241, "新津駅"]
Nagaoka     = [37.447586, 138.853880, "長岡駅"]
Kashiwazaki = [37.363625, 138.555684, "柏崎駅"]
Naoetsu     = [37.171482, 138.243200, "直江津駅"]
Itoigawa    = [37.043467, 137.861715, "糸魚川駅"]
Oyashirazu  = [37.006736, 137.738299, "親不知駅"]

# 16_富山県
Tomari        = [36.951977, 137.555720, "泊駅"]
Toyama        = [36.701680, 137.212916, "富山駅"]
Takaoka       = [36.741523, 137.015088, "高岡駅"]
Marunouchi    = [36.692485, 137.208891, "丸の内駅"]
Sakurabashi   = [36.695038, 137.215938, "桜橋駅"]
Higashi_Iwase = [36.752457, 137.230762, "東岩瀬駅"]
Iwasehama     = [36.761497, 137.233955, "岩瀬浜駅"]

# 17_石川県
Kanazawa = [36.578334, 136.647834, "金沢駅"]

# 18_福井県
Fukui   = [36.062161, 136.222198, "福井駅"]
Tsuruga = [35.644857, 136.076294, "敦賀駅"]

# 19_山梨県

# 20_長野県
Kamisuwa         = [36.046683, 138.116482, "上諏訪駅"]
Narai            = [35.969047, 137.815473, "奈良井駅"]
Shiojiri         = [36.114328, 137.947801, "塩尻駅"]
Hirooka          = [36.148256, 137.949566, "広丘駅"]
Hirata           = [36.191562, 137.962512, "平田駅"]
Minami_Matsumoto = [36.209715, 137.968941, "南松本駅"]
Matsumoto        = [36.230855, 137.964325, "松本駅"]
Obasute          = [36.502568, 138.093304, "姨捨駅"]
Nagano           = [36.643009, 138.188673, "長野駅"]
Gondo            = [36.653264, 138.191946, "権堂駅"]

# 21_岐阜県
Gifu          = [35.409532, 136.756514, "岐阜駅"]
Ogaki         = [35.367096, 136.618288, "大垣駅"]
Gero          = [35.805345, 137.239778, "下呂駅"]
Takayama      = [36.140574, 137.251301, "高山駅"]
Hida_Furukawa = [36.236727, 137.189681, "飛騨古川駅"]
Shirakawago   = [36.261988, 136.906768, "白川郷バスターミナル"]

# 22_静岡県
Atami      = [35.103573, 139.077679, "熱海駅"]
Mishima    = [35.126253, 138.911133, "三島駅"]
Numazu     = [35.103011, 138.860104, "沼津駅"]
Shimizu    = [35.023248, 138.488958, "清水駅"]
Shizuoka   = [34.971629, 138.388579, "静岡駅"]
Bentenjima = [34.690125, 137.603058, "弁天島駅"]

# 23_愛知県
Toyohashi          = [34.762734, 137.382128, "豊橋駅"]
Kanayama           = [35.142928, 136.900517, "金山駅"]
Nagoya             = [35.170694, 136.881637, "名古屋駅"]
Sakae              = [35.169990, 136.908031, "栄駅"]
Nagoya_Castle      = [35.181560, 136.905379, "名古屋城駅"]
Atsuta_Jingu_Nishi = [35.127956, 136.906769, "熱田神宮西駅"]
Kamimaezu          = [35.157477, 136.906815, "上前津駅"]
Osu_Kannon         = [35.160729, 136.898158, "大須観音駅"]
Fushimi            = [35.169273, 136.897427, "伏見駅"]
Nagoya_University  = [35.154261, 136.966580, "名古屋大学駅"]

# 24_三重県
Iseshi    = [34.491260, 136.709661, "伊勢市駅"]
Ujiyamada = [34.488256, 136.714002, "宇治山田駅"]

# 25_滋賀県
Omi_Shiotsu = [35.539780, 136.151236, "近江塩津駅"]
Nagahama    = [35.378828, 136.264901, "長浜駅"]
Maibara     = [35.314657, 136.289992, "米原駅"]
Hikone      = [35.272216, 136.263347, "彦根駅"]

# 26_京都府
Kyoto             = [34.985465, 135.757748, "京都駅"]
MukoMachi         = [34.954838, 135.709804, "向日町駅"]
Inari             = [34.966758, 135.770707, "稲荷駅"]
Uji               = [34.890437, 135.800629, "宇治駅"]
Saga_Arashiyama   = [35.018698, 135.68127, "嵯峨嵐山駅"]
Kameoka           = [35.016738, 135.582766, "亀岡駅"]
Fukuchiyama       = [35.296143, 135.118564, "福知山駅"]
Amanohashidate    = [35.557729, 135.182456, "天橋立駅"]
Fushimi_Inari     = [34.968966, 135.769279, "伏見稲荷駅"]
Shimizu_Gojyo     = [34.995691, 135.768378, "清水五条駅"]
Higashiyama       = [35.009425, 135.780448, "東山駅"]
Nijyo_Castle      = [35.011892, 135.750473, "二条城前駅"]
Tenjingawa        = [35.010816, 135.716085, "太秦天神川駅・嵐電天神川駅"]
Arashiyama        = [35.015271, 135.677698, "嵐山駅"]
Katabiranotsuji   = [35.015146, 135.700257, "帷子ノ辻󠄀駅"]
Kitano_Hakubaicho = [35.027409, 135.730846, "北野白梅町駅"]
Shijo_Omiya       = [35.003190, 135.748395, "四条大宮駅・大宮駅"]
Karasuma          = [35.003665, 135.759108, "烏丸駅・四条駅"]

# 27_大阪府
Shin_Osaka        = [34.734136, 135.501852, "新大阪駅"]
Osaka             = [34.702398, 135.495188, "大阪駅"]
Umeda             = [34.703765, 135.497496, "梅田駅"]
Shinsaibashi      = [34.675012, 135.500330, "心斎橋駅"]
JR_Namba          = [34.666438, 135.495265, "JR難波駅"]
Namba             = [34.666316, 135.500277, "なんば駅"]
Nankai_Namba      = [34.66357, 135.501949, "南海なんば駅"]
Imamiya           = [34.654156, 135.492975, "今宮駅"]
Dobutsuen_Mae     = [34.648815, 135.504413, "動物園前駅"]
Tennoji           = [34.647243, 135.514124, "天王寺駅"]
Tanimachi_4_Chome = [34.681914, 135.517253, "谷町四丁目駅"]
Temmabashi        = [34.690200, 135.516633, "天満橋駅"]
Higashi_Umeda     = [34.701031, 135.499690, "東梅田駅"]

# 28_兵庫県
Shin_Kobe               = [34.706417, 135.195758, "新神戸駅"]
Nada                    = [34.705918, 135.216578, "灘駅"]
Sannomiya               = [34.694766, 135.195058, "三ノ宮駅"]
Kyukyoryuchi_Daimarumae = [34.689369, 135.189836, "旧居留地・大丸前駅"]
Minato_Motomachi        = [34.685875, 135.183973, "みなと元町駅"]
Harborland              = [34.678554, 135.178657, "ハーバーランド駅"]
Kobe                    = [34.679453, 135.178221, "神戸駅"]
Maiko                   = [34.633020, 135.034373, "舞子駅"]
Akashi                  = [34.649084, 134.992512, "明石駅"]
Himeji                  = [34.827659, 134.690769, "姫路駅"]
Aioi                    = [34.818052, 134.473410, "相生駅"]
Kamigori                = [34.865845, 134.354081, "上郡駅"]
Kinosaki_Onsen          = [35.623764, 134.813437, "城崎温泉駅"]
Amarube                 = [35.648658, 134.556918, "餘部駅"]
Hamasaka                = [35.620618, 134.452558, "浜坂駅"]

# 29_奈良県
# 30_和歌山県
# 31_鳥取県
# 32_島根県
# 33_岡山県
# 34_広島県
# 35_山口県
# 36_徳島県
# 37_香川県
# 38_愛媛県
# 39_高知県
# 40_福岡県
# 41_佐賀県
# 42_長崎県
# 43_熊本県
# 44_大分県
# 45_宮崎県
# 46_鹿児島県
# 47_沖縄県


