# 01_北海道
New_Chitose_Airport = [42.787651, 141.681057, "新千歳空港駅"]
Minami_Chitose      = [42.808398, 141.675327, "南千歳駅"]
Sapporo             = [43.068567, 141.350710, "札幌駅"]
Higashi_Muroran     = [42.348739, 141.025344, "東室蘭駅"]
Bokoi               = [42.317166, 140.989379, "母恋駅"]
Muroran             = [42.317977, 140.974389, "室蘭駅"]
Touya               = [42.550544, 140.763564, "洞爺駅"]
Hakodate            = [41.773745, 140.726361, "函館駅"]
Onuma_Koen          = [41.981111, 140.670016, "大沼公園駅"]
Oshamambe           = [42.513106, 140.375784, "長万部駅"]
Kutchan             = [42.901688, 140.745754, "倶知安駅"]
Otaru               = [43.197648, 140.993656, "小樽駅"]
Asakikawa           = [43.762760, 142.358301, "旭川駅"]
Naka_Furano         = [43.405745, 142.421156, "中富良野駅"]
Furano              = [43.346756, 142.391273, "富良野駅"]
Nayoro              = [44.349414, 142.465149, "名寄駅"]
Wakkanai            = [45.417033, 141.677149, "稚内駅"]
Engaru              = [44.059848, 143.520489, "遠軽駅"]
Kitami              = [43.804898, 143.897220, "北見駅"]
Abashiri            = [44.020026, 144.253973, "網走駅"]
Kushiro_Shitsugen   = [43.100575, 144.447810, "釧路湿原駅"]
Kushiro             = [42.990305, 144.382354, "釧路駅"]
Nemuro              = [43.326891, 145.582661, "根室駅"]
Higashi_Nemuro      = [43.323667, 145.597220, "東根室駅"]
Obihiro             = [42.917977, 143.202032, "帯広駅"]

# 02_青森県
Aomori      = [40.828761, 140.734279, "青森駅"]
Shin_Aomori = [40.828106, 140.693469, "新青森駅"]
Hachinohe   = [40.509422, 141.430985, "八戸駅"]
Hirosaki    = [40.598988, 140.484981, "弘前駅"]

# 03_岩手県
Ninohe     = [40.260026, 141.285715, "二戸駅"]
Morioka    = [39.701596, 141.136600, "盛岡駅"]
Kitakami   = [39.281477, 141.122211, "北上駅"]
Hiraizumi  = [38.988048, 141.117496, "平泉駅"]
Ichinoseki = [38.926274, 141.137616, "一ノ関駅"]

# 04_宮城県
Kogota        = [38.541401, 141.064233, "小牛田駅"]
Matsushima    = [38.379842, 141.066100, "松島駅"]
Sendai        = [38.259685, 140.882651, "仙台駅"]
Shiroishi_Zao = [37.995192, 140.632960, "白石蔵王駅"]

# 05_秋田県
Akita      = [39.716844, 140.129710, "秋田駅"]
Omagari    = [39.465455, 140.479593, "大曲駅"]
Yokote     = [39.310275, 140.560588, "横手駅"]
Kakunodate = [39.591751, 140.571026, "角館駅"]

# 06_山形県
Shinjyo  = [38.762402, 140.306000, "新庄駅"]
Yamagata = [38.248661, 140.327545, "山形駅"]
Akayu    = [38.047429, 140.148982, "赤湯駅"]
Miyauchi = [38.071158, 140.135003, "宮内駅"]
Yonezawa = [37.909559, 140.128087, "米沢駅"]
Sakata   = [38.921836, 139.845966, "酒田駅"]

# 07_福島県
Fukushima      = [37.754211, 140.459910, "福島駅"]
Nihonmatsu     = [37.589752, 140.435409, "二本松駅"]
Koriyama       = [37.398150, 140.388460, "郡山駅"]
Aizu_Wakamatsu = [37.507878, 139.930310, "会津若松駅"]
Nanukamachi    = [37.501135, 139.919040, "七日町駅"]
Shirakawa      = [37.129621, 140.213740, "白河駅"]
Shin_Shirakawa = [37.122519, 140.188146, "新白河駅"]

# 08_茨城県
Hitachi_Taga = [36.552102, 140.632360, "常陸多賀駅"]
Katsuta      = [36.394540, 140.524349, "勝田駅"]
Mito         = [36.370819, 140.476199, "水戸駅"]
Koga         = [36.194722, 139.709572, "古河駅"]

# 09_栃木県
Kuroiso    = [36.969893, 140.059837, "黒磯駅"]
Utsunomiya = [36.559056, 139.898357, "宇都宮駅"]
Nikko      = [36.747265, 139.622011, "日光駅"]

# 10_群馬県
Takasaki                = [36.322466, 139.012631, "高崎駅"]
Naganohara_Kusatsuguchi = [36.546704, 138.648063, "長野原草津口駅"]
Kusatsu                 = [36.620828, 138.596340, "草津温泉バスターミナル"]
Joshu_Tomioka           = [36.260367, 138.892104, "上州富岡駅"]

# 11_埼玉県
Kurihashi = [36.136805, 139.694221, "栗橋駅"]
Yagyu     = [36.206651, 139.659569, "柳生駅"]
Omiya     = [35.906917, 139.622806, "大宮駅"]
Miyahara  = [35.940198, 139.609503, "宮原駅"]
Kawagoe   = [35.907122, 139.482913, "川越駅"]
Wakoshi   = [35.788499, 139.612381, "和光市駅"]

# 12_千葉県
Funabashi                 = [35.701632, 139.985358, "船橋駅"]
Tsudanuma                 = [35.691266, 140.020374, "津田沼駅"]
Nishi_Chiba               = [35.622316, 140.103574, "西千葉駅"]
Chiba                     = [35.613250, 140.113361, "千葉駅"]
Higashi_Chiba             = [35.616813, 140.122102, "東千葉駅"]
Tsuga                     = [35.636086, 140.149269, "都賀駅"]
Sakura                    = [35.709702, 140.226068, "佐倉駅"]
Shisui                    = [35.731779, 140.275305, "酒々井駅"]
Narita                    = [35.777832, 140.314086, "成田駅"]
Narita_Airport_Terminal_1 = [35.764985, 140.385726, "成田空港駅"]
Narita_Airport_Terminal_2 = [35.773215, 140.387091, "空港第2ビル駅"]
Awa_Kamogawa              = [35.107611, 140.103823, "安房鴨川駅"]
Tateyama                  = [34.995790, 139.862085, "館山駅"]

# 13_東京都
Tokyo          = [35.681041, 139.767106, "東京駅"]
Ueno           = [35.713365, 139.776703, "上野駅"]
Ikebukuro      = [35.730085, 139.711095, "池袋駅"]
Shinjuku       = [35.689579, 139.700676, "新宿駅"]
Shibuya        = [35.658424, 139.701509, "渋谷駅"]
Shinagawa      = [35.628431, 139.739030, "品川駅"]
Shinbashi      = [35.666536, 139.758177, "新橋駅"]
Naneda_Airport = [35.549931, 139.786380, "羽田空港第1・第2ターミナル駅"]

# 14_神奈川県
Yokohama    = [35.465767, 139.622249, "横浜駅"]
Sakuragicho = [35.451007, 139.630957, "桜木町駅"]
Ofuna       = [35.353868, 139.531277, "大船駅"]
Kamakura    = [35.318934, 139.550422, "鎌倉駅"]
Hase        = [35.311243, 139.535893, "長谷駅"]
Enoshima    = [35.310974, 139.487433, "湘南江の島駅・江ノ島駅"]
Fujisawa    = [35.338844, 139.487307, "藤沢駅"]
Odawara     = [35.256246, 139.154674, "小田原駅"]
Nebukawa    = [35.202681, 139.138492, "根府川駅"]

# 15_新潟県
Shibata     = [37.944012, 139.334803, "新発田駅"]
Niigata     = [37.912135, 139.061371, "新潟駅"]
Niitsu      = [37.799922, 139.121241, "新津駅"]
Nagaoka     = [37.447586, 138.853880, "長岡駅"]
Kashiwazaki = [37.363625, 138.555684, "柏崎駅"]
Naoetsu     = [37.171482, 138.243200, "直江津駅"]
Itoigawa    = [37.043467, 137.861715, "糸魚川駅"]
Oyashirazu  = [37.006736, 137.738299, "親不知駅"]

# 16_富山県

# 17_石川県

# 18_福井県

# 19_山梨県

# 20_長野県

# 21_岐阜県
Gifu          = [35.409499, 136.756529, "岐阜駅"]
Ogaki         = [35.366980, 136.617861, "大垣駅"]
Gero          = [35.805303, 137.239782, "下呂駅"]
Takayama      = [36.141069, 137.251285, "高山駅"]
Hida_Furukawa = [36.236700, 137.189603, "飛騨古川駅"]
Shirakawago   = [36.261988, 136.906768, "白川郷バスターミナル"]

# 22_静岡県
Atami      = [35.103654, 139.077800, "熱海駅"]
Mishima    = [35.126222, 138.911046, "三島駅"]
Numazu     = [35.103085, 138.859532, "沼津駅"]
Shimizu    = [35.023362, 138.488944, "清水駅"]
Shizuoka   = [34.971754, 138.389027, "静岡駅"]
Bentenjima = [34.690120, 137.603128, "弁天島駅"]

# 23_愛知県
Toyohashi          = [34.762809, 137.381668, "豊橋駅"]
Kanayama           = [35.142949, 136.901199, "金山駅"]
Nagoya             = [35.170680, 136.881638, "名古屋駅"]
Sakae              = [35.170019, 136.908560, "栄駅"]
Nagoya_Castle      = [35.181455, 136.905373, "名古屋城駅"]
Atsuta_Jingu_Nishi = [35.127930, 136.906524, "熱田神宮西駅"]
Kamimaezu          = [35.157319, 136.905864, "上前津駅"]
Osu_Kannon         = [35.160606, 136.898270, "大須観音駅"]
Fushimi            = [35.169238, 136.897401, "伏見駅"]
Nagoya_University  = [35.154797, 136.966756, "名古屋大学駅"]

# 24_三重県
Iseshi    = [34.491099, 136.709546, "伊勢市駅"]
Ujiyamada = [34.488068, 136.713929, "宇治山田駅"]

# 25_滋賀県
Omi_Shiotsu = [35.538530, 136.151672, "近江塩津駅"]
Nagahama    = [35.378451, 136.265161, "長浜駅"]
Maibara     = [35.314721, 136.289839, "米原駅"]
Hikone      = [35.272205, 136.263344, "彦根駅"]

# 26_京都府
Kyoto             = [34.985237, 135.758504, "京都駅"]
MukoMachi         = [34.954921, 135.709491, "向日町駅"]
Inari             = [34.966831, 135.770749, "稲荷駅"]
Uji               = [34.890388, 135.800674, "宇治駅"]
Saga_Arashiyama   = [35.018741, 135.681269, "嵯峨嵐山駅"]
Kameoka           = [35.016710, 135.582420, "亀岡駅"]
Fukuchiyama       = [35.296175, 135.118296, "福知山駅"]
Amanohashidate    = [35.557671, 135.182459, "天橋立駅"]
Fushimi_Inari     = [34.968687, 135.769239, "伏見稲荷駅"]
Shimizu_Gojyo     = [34.995916, 135.768575, "清水五条駅"]
Higashiyama       = [35.009385, 135.779820, "東山駅"]
Nijyo_Castle      = [35.011852, 135.750391, "二条城前駅"]
Tenjingawa        = [35.010810, 135.715760, "太秦天神川駅・嵐電天神川駅"]
Arashiyama        = [35.015188, 135.677683, "嵐山駅"]
Katabiranotsuji   = [35.015196, 135.700295, "帷子ノ辻󠄀駅"]
Kitano_Hakubaicho = [35.027352, 135.731075, "北野白梅町駅"]
Shijo_Omiya       = [35.003294, 135.748528, "四条大宮駅・大宮駅"]
Karasuma          = [35.003655, 135.759885, "烏丸駅・四条駅"]

# 27_大阪府
Shin_Osaka        = [34.733410, 135.499943, "新大阪駅"]
Osaka             = [34.702388, 135.495866, "大阪駅"]
Umeda             = [34.702916, 135.497785, "梅田駅"]
JR_Namba          = [34.666525, 135.495308, "JR難波駅"]
Nankai_Namba      = [34.663303, 135.502004, "南海なんば駅"]
Namba             = [34.665905, 135.500338, "なんば駅"]
Imamiya           = [34.654197, 135.492867, "今宮駅"]
Shinsaibashi      = [34.674203, 135.500347, "心斎橋駅"]
Dobutsuen_Mae     = [34.648716, 135.504561, "動物園前駅"]
Tennoji           = [34.647275, 135.513874, "天王寺駅"]
Tanimachi_4_Chome = [34.682368, 135.517276, "谷町四丁目駅"]
Temmabashi        = [34.690145, 135.516424, "天満橋駅"]
Higashi_Umeda     = [34.701127, 135.499463, "東梅田駅"]

# 28_兵庫県
Shin_Kobe               = [34.706464, 135.195759, "新神戸駅"]
Sannomiya               = [34.694158, 135.194402, "三ノ宮駅・三宮駅・三宮・花時計前駅"]
Kyukyoryuchi_Daimarumae = [34.690513, 135.195196, "旧居留地・大丸前駅"]
Minato_Motomachi        = [34.690513, 135.192196, "みなと元町駅"]
Harborland              = [34.690513, 135.190196, "ハーバーランド駅"]
Kobe                    = [34.679452, 135.178196, "神戸駅"]
Maiko                   = [34.633475, 135.033771, "舞子駅"]
Akashi                  = [34.648976, 134.993237, "明石駅"]
Himeji                  = [34.826758, 134.690513, "姫路駅"]
Aioi                    = [34.818059, 134.473933, "相生駅"]
Kinosaki_Onsen          = [35.623703, 134.813489, "城崎温泉駅"]
Amarube                 = [35.648724, 134.557026, "余部駅"]
Hamasaka                = [35.620866, 134.452337, "浜坂駅"]
