# 01_北海道
New_Chitose_Airport = [42.787651, 141.681057, "新千歳空港駅"]
Minami_Chitose      = [42.808398, 141.675327, "南千歳駅"]
Sapporo             = [43.068567, 141.350710, "札幌駅"]
Higashi_Muroran     = [42.348739, 141.025344, "東室蘭駅"]
Bokoi               = [42.317166, 140.989379, "母恋駅"]
Muroran             = [42.317977, 140.974389, "室蘭駅"]
Touya               = [42.550544, 140.763564, "洞爺駅"]
Hakodate            = [41.773745, 140.726361, "函館駅"]
Onuma_Koen          = [41.981111, 140.670016, "大沼公園駅"]
Oshamambe           = [42.513106, 140.375784, "長万部駅"]
Kutchan             = [42.901688, 140.745754, "倶知安駅"]
Otaru               = [43.197648, 140.993656, "小樽駅"]
Asakikawa           = [43.762760, 142.358301, "旭川駅"]
Naka_Furano         = [43.405745, 142.421156, "中富良野駅"]
Furano              = [43.346756, 142.391273, "富良野駅"]
Nayoro              = [44.349414, 142.465149, "名寄駅"]
Wakkanai            = [45.417033, 141.677149, "稚内駅"]
Kitami              = [43.804898, 143.897220, "北見駅"]
Abashiri            = [44.020026, 144.253973, "網走駅"]
Kushiro_Shitsugen   = [43.100575, 144.447810, "釧路湿原駅"]
Kushiro             = [42.990305, 144.382354, "釧路駅"]
Nemuro              = [43.326891, 145.582661, "根室駅"]
Higashi_Nemuro      = [43.323667, 145.597220, "東根室駅"]
Obihiro             = [42.917977, 143.202032, "帯広駅"]

# 02_青森県
Aomori      = [40.828761, 140.734279, "青森駅"]
Shin_Aomori = [40.828106, 140.693469, "新青森駅"]
Hachinohe   = [40.509422, 141.430985, "八戸駅"]
Hirosaki    = [40.598988, 140.484981, "弘前駅"]

# 03_岩手県
Ninohe     = [40.260026, 141.285715, "二戸駅"]
Morioka    = [39.701596, 141.136600, "盛岡駅"]
Kitakami   = [39.281477, 141.122211, "北上駅"]
Hiraizumi  = [38.988048, 141.117496, "平泉駅"]
Ichinoseki = [38.926274, 141.137616, "一ノ関駅"]

# 04_宮城県
Kogota     = [38.541401, 141.064233, "小牛田駅"]
Matsushima = [38.379842, 141.066100, "松島駅"]
Sendai     = [38.259685, 140.882651, "仙台駅"]

# 05_秋田県
Akita      = [39.716844, 140.129710, "秋田駅"]
Omagari    = [39.465455, 140.479593, "大曲駅"]
Yokote     = [39.310275, 140.560588, "横手駅"]
Kakunodate = [39.591751, 140.571026, "角館駅"]

# 06_山形県
Shinjyo  = [38.762402, 140.306000, "新庄駅"]
Yamagata = [38.248661, 140.327545, "山形駅"]
Akayu    = [38.047429, 140.148982, "赤湯駅"]
Miyauchi = [38.071158, 140.135003, "宮内駅"]
Yonezawa = [37.909559, 140.128087, "米沢駅"]
Sakata   = [38.921836, 139.845966, "酒田駅"]

# 07_福島県
Fukushima      = [37.754211, 140.459910, "福島駅"]
Nihonmatsu     = [37.589752, 140.435409, "二本松駅"]
Koriyama       = [37.398150, 140.388460, "郡山駅"]
Aizu_Wakamatsu = [37.507878, 139.930310, "会津若松駅"]
Nanukamachi    = [37.501135, 139.919040, "七日町駅"]
Shirakawa      = [37.129621, 140.213740, "白河駅"]
Shin_Shirakawa = [37.122519, 140.188146, "新白河駅"]

# 08_茨城県
Hitachi_Taga = [36.552102, 140.632360, "常陸多賀駅"]
Katsuta      = [36.394540, 140.524349, "勝田駅"]
Mito         = [36.370819, 140.476199, "水戸駅"]
Koga         = [36.194722, 139.709572, "古河駅"]

# 09_栃木県
Kuroiso    = [36.969893, 140.059837, "黒磯駅"]
Utsunomiya = [36.559056, 139.898357, "宇都宮駅"]
Nikko      = [36.747265, 139.622011, "日光駅"]

# 10_群馬県
Takasaki                = [36.322466, 139.012631, "高崎駅"]
Naganohara_Kusatsuguchi = [36.546704, 138.648063, "長野原草津口駅"]
Kusatsu                 = [36.620828, 138.596340, "草津温泉バスターミナル"]
Joshu_Tomioka           = [36.260367, 138.892104, "上州富岡駅"]

# 11_埼玉県
Kurihashi = [36.136805, 139.694221, "栗橋駅"]
Yagyu     = [36.206651, 139.659569, "柳生駅"]
Omiya     = [35.906917, 139.622806, "大宮駅"]
Miyahara  = [35.940198, 139.609503, "宮原駅"]
Kawagoe   = [35.907122, 139.482913, "川越駅"]
Wakoshi   = [35.788499, 139.612381, "和光市駅"]

# 12_千葉県
Chiba                     = [35.613250, 140.113361, "千葉駅"]
Sakura                    = [35.709702, 140.226068, "佐倉駅"]
Shisui                    = [35.731779, 140.275305, "酒々井駅"]
Narita                    = [35.777832, 140.314086, "成田駅"]
Narita_Airport_Terminal_1 = [35.764985, 140.385726, "成田空港駅"]
Narita_Airport_Terminal_2 = [35.773215, 140.387091, "空港第2ビル駅"]

# 13_東京都
Tokyo = [35.681041, 139.767106, "東京駅"]

# 14_神奈川県

# 15_新潟県
Shibata     = [37.944012, 139.334803, "新発田駅"]
Niigata     = [37.912135, 139.061371, "新潟駅"]
Niitsu      = [37.799922, 139.121241, "新津駅"]
Nagaoka     = [37.447586, 138.853880, "長岡駅"]
Kashiwazaki = [37.363625, 138.555684, "柏崎駅"]
Naoetsu     = [37.171482, 138.243200, "直江津駅"]
Itoigawa    = [37.043467, 137.861715, "糸魚川駅"]
Oyashirazu  = [37.006736, 137.738299, "親不知駅"]

# 16_富山県

# 17_石川県

# 18_福井県

# 19_山梨県

# 20_長野県

# 21_岐阜県

# 22_静岡県

# 23_愛知県
Nagoya = [35.170706, 136.88253, "名古屋駅"]

# 24_三重県
Iseshi    = [34.491099, 136.709546, "伊勢市駅"]
Ujiyamada = [34.488068, 136.713929, "宇治山田駅"]